////////////////////////////////////////////////////////////////////////////////
// Подсистема "Метрологическая служба. Единицы величин".
// ОбщийМодуль.ЕдиницыВеличинКлиентСервер.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает номер версии библиотеки.
//
// Возвращаемое значение:
//	Строка - номер версии библиотеки.
//
Функция ВерсияБиблиотеки() Экспорт
	
	Возврат "1.0.2.25";
	
КонецФункции

// Возвращает наименование единицы величины или приставки.
//
// Параметры:
// 	ЕдиницаВеличиныИлиПриставка	- Ссылка, Объект, Структура - Сссылка, объект, структура приставки,
//    единицы величины.
// 	ОбозначениеЕдиницыВеличин - ОбозначенияЕдиницВеличин	- Вариант обозначения единиц величин.
//
// Возвращаемое значение: Строка
//
Функция ПолучитьНаименование(Знач ЕдиницаВеличиныИлиПриставка, Знач ОбозначениеЕдиницыВеличин = Неопределено) Экспорт

	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		"ЕдиницыВеличинКлиентСервер.ПолучитьНаименование",
		"ЕдиницаВеличиныИлиПриставка",
		ЕдиницаВеличиныИлиПриставка,
		Новый ОписаниеТипов(
			"СправочникСсылка.ЕдиницыВеличин, СправочникОбъект.ЕдиницыВеличин,
			|СправочникСсылка.ПриставкиЕдиницыВеличин, СправочникОбъект.ПриставкиЕдиницыВеличин,
			|ДанныеФормыСтруктура, Структура"),
		ЕдиницыВеличинКлиентСерверПовтИсп.ПолучитьТипыСвойствНаименованияИОбозначения());
		
	Если ЗначениеЗаполнено(ЕдиницаВеличиныИлиПриставка) Тогда
		Возврат ЕдиницаВеличиныИлиПриставка[ЕдиницыВеличинКлиентСерверПовтИсп.ПолучитьРеквизитНаименования(ОбозначениеЕдиницыВеличин)];
	Иначе
		Возврат "";
	КонецЕсли;

КонецФункции

// Возвращает обозначение единицы величины или приставки.
//
// Параметры:
// 	ЕдиницаВеличиныИлиПриставка	- Ссылка, Объект, Структура - Сссылка, объект, структура приставки,
//    единицы величины.
// 	ОбозначениеЕдиницыВеличин - ОбозначенияЕдиницВеличин	- Вариант обозначения единиц величин.
//
// Возвращаемое значение: Строка
//
Функция ПолучитьОбозначение(Знач ЕдиницаВеличиныИлиПриставка, Знач ОбозначениеЕдиницыВеличин = Неопределено) Экспорт

	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		"ЕдиницыВеличинКлиентСервер.ПолучитьОбозначение",
		"ЕдиницаВеличиныИлиПриставка",
		ЕдиницаВеличиныИлиПриставка,
		Новый ОписаниеТипов(
			"СправочникСсылка.ЕдиницыВеличин, СправочникОбъект.ЕдиницыВеличин,
			|СправочникСсылка.ПриставкиЕдиницыВеличин, СправочникОбъект.ПриставкиЕдиницыВеличин,
			|ДанныеФормыСтруктура, Структура"),
		ЕдиницыВеличинКлиентСерверПовтИсп.ПолучитьТипыСвойствНаименованияИОбозначения());

	Если ЗначениеЗаполнено(ЕдиницаВеличиныИлиПриставка) Тогда
		Возврат ЕдиницаВеличиныИлиПриставка[ЕдиницыВеличинКлиентСерверПовтИсп.ПолучитьРеквизитОбозначения(ОбозначениеЕдиницыВеличин)];
	Иначе
		Возврат "";
	КонецЕсли;

КонецФункции

// Возвращает предлог, используемый перед единицей величины в знаменателе производной единицы.
//
// Параметры:
// 	ЕдиницаВеличины	- Ссылка, Объект, Структура - Сссылка, объект, структура единицы величины.
// 	ОбозначениеЕдиницыВеличин - ОбозначенияЕдиницВеличин	- Вариант обозначения единиц величин.
//
// Возвращаемое значение: Строка
//
Функция ПолучитьПредлогДляЗнаменателя(Знач ЕдиницаВеличины, Знач ОбозначениеЕдиницыВеличин = Неопределено) Экспорт

	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		"ЕдиницыВеличинКлиентСервер.ПолучитьПредлогДляЗнаменателя",
		"ЕдиницаВеличины",
		ЕдиницаВеличины,
		Новый ОписаниеТипов(
			"СправочникСсылка.ЕдиницыВеличин, СправочникОбъект.ЕдиницыВеличин,
			|ДанныеФормыСтруктура, Структура"),
		ЕдиницыВеличинКлиентСерверПовтИсп.ПолучитьТипыСвойствНаименованияИОбозначения());

	Если ЗначениеЗаполнено(ЕдиницаВеличины) Тогда
		Возврат ЕдиницаВеличины[ЕдиницыВеличинКлиентСерверПовтИсп.ПолучитьРеквизитПредлогаДляЗнаменателя(ОбозначениеЕдиницыВеличин)];
	Иначе
		Возврат "";
	КонецЕсли;

КонецФункции

// Возвращает признак необходимости пробела после значения и перед обозначением единицы величины.
//
// Параметры:
// 	ЕдиницаВеличины	- Ссылка, Объект, Структура - Сссылка, объект, структура единицы величины.
// 	ОбозначениеЕдиницыВеличин - ОбозначенияЕдиницВеличин	- Вариант обозначения единиц величин.
//
// Возвращаемое значение: Булево
//
Функция ПолучитьПробелПередОбозначением(Знач ЕдиницаВеличины, Знач ОбозначениеЕдиницыВеличин = Неопределено) Экспорт

	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		"ЕдиницыВеличинКлиентСервер.ПолучитьПредлогДляЗнаменателя",
		"ЕдиницаВеличины",
		ЕдиницаВеличины,
		Новый ОписаниеТипов(
			"СправочникСсылка.ЕдиницыВеличин, СправочникОбъект.ЕдиницыВеличин,
			|ДанныеФормыСтруктура, Структура"),
		ЕдиницыВеличинКлиентСерверПовтИсп.ПолучитьТипыСвойствНаименованияИОбозначения());

	Если ЗначениеЗаполнено(ЕдиницаВеличины) Тогда
		Возврат ЕдиницаВеличины[ЕдиницыВеличинКлиентСерверПовтИсп.ПолучитьРеквизитПробелПередОбозначением(ОбозначениеЕдиницыВеличин)];
	Иначе
		Возврат "";
	КонецЕсли;

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти
