#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой СтандартныеПодсистемыИТГ.СтруктурированныеРеквизиты.

// Возвращает описание реквизитов, содержащих структурированные данные.
//
// Возвращаемое значение:
//  Массив - содержит строки в формате ИмяРеквизита:ИмяТипаСтруктурированныхДанных[;ИмяЭлементаФормы,...]
//           где ИмяРеквизита - имя реквизита объекта, ИмяЭлементаФормы - имя элемента формы,
//           связанного с реквизитом.
//
Функция ПолучитьСтруктурированныеРеквизитыОбъекта() Экспорт
	
	Перем СтруктурированныеРеквизитыОбъекта;
	СтруктурированныеРеквизитыОбъекта = Новый Массив;
	
	СтруктурированныеРеквизитыОбъекта.Добавить("Реквизит1ТипаЧисло:Число");
	
	Возврат СтруктурированныеРеквизитыОбъекта;

КонецФункции

#КонецОбласти

#КонецЕсли
