////////////////////////////////////////////////////////////////////////////////
// Подсистема "Метрологическая служба. Единицы величин".
// ОбщийМодуль.МСЕдиницыВеличинКлиентСервер.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает номер версии библиотеки.
//
// Возвращаемое значение:
//	Строка - номер версии библиотеки.
//
Функция ВерсияБиблиотеки() Экспорт
	
	Возврат "1.0.2.19";
	
КонецФункции

// Возвращает наименование единицы величины или приставки.
//
// Параметры:
// 	ЕдиницаВеличиныИлиПриставка	- Ссылка, Объект, Структура - Сссылка, объект, структура приставки,
//								                              единицы величины.
//
// Возвращаемое значение:
//  Строка - Наименование.
//
Функция ПолучитьНаименование(Знач ЕдиницаВеличиныИлиПриставка) Экспорт

	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		"МСЕдиницыВеличинКлиентСервер.ПолучитьНаименование",
		"ЕдиницаВеличиныИлиПриставка",
		ЕдиницаВеличиныИлиПриставка,
		Новый ОписаниеТипов(
			"СправочникСсылка.МСЕдиницыВеличинБазовые, СправочникОбъект.МСЕдиницыВеличинБазовые," +
			"СправочникСсылка.МСЕдиницыВеличинПриставкиКратныхИДольных, СправочникОбъект.МСЕдиницыВеличинПриставкиКратныхИДольных," +
			"ДанныеФормыСтруктура, Структура"),
		МСЕдиницыВеличинКлиентСерверПовтИсп.ПолучитьТипыСвойствНаименованияИОбозначения());

	Если ЗначениеЗаполнено(ЕдиницаВеличиныИлиПриставка) Тогда
		Возврат ЕдиницаВеличиныИлиПриставка[МСЕдиницыВеличинКлиентСерверПовтИсп.ПолучитьРеквизитНаименования()];
	Иначе
		Возврат "";
	КонецЕсли;

КонецФункции

// Возвращает обозначение единицы величины или приставки.
//
// Параметры:
// 	ЕдиницаВеличиныИлиПриставка	- Ссылка, Объект, Структура - Сссылка, объект, структура приставки,
//															  единицы величины.
//
// Возвращаемое значение:
//  Строка - Обозначение.
//
Функция ПолучитьОбозначение(Знач ЕдиницаВеличиныИлиПриставка) Экспорт

	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		"МСЕдиницыВеличинКлиентСервер.ПолучитьОбозначение",
		"ЕдиницаВеличиныИлиПриставка",
		ЕдиницаВеличиныИлиПриставка,
		Новый ОписаниеТипов(
			"СправочникСсылка.МСЕдиницыВеличинБазовые, СправочникОбъект.МСЕдиницыВеличинБазовые," +
			"СправочникСсылка.МСЕдиницыВеличинПриставкиКратныхИДольных, СправочникОбъект.МСЕдиницыВеличинПриставкиКратныхИДольных," +
			"ДанныеФормыСтруктура, Структура"),
		МСЕдиницыВеличинКлиентСерверПовтИсп.ПолучитьТипыСвойствНаименованияИОбозначения());

	Если ЗначениеЗаполнено(ЕдиницаВеличиныИлиПриставка) Тогда
		Возврат ЕдиницаВеличиныИлиПриставка[МСЕдиницыВеличинКлиентСерверПовтИсп.ПолучитьРеквизитОбозначения()];
	Иначе
		Возврат "";
	КонецЕсли;

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти
