#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

// Для внутреннего использования.
// 
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Обозначение = РаботаСЕдиницамиВеличинСервер.СформироватьОбозначениеЕдиницыВеличины(ЭтотОбъект);
	Наименование = РаботаСЕдиницамиВеличинСервер.СформироватьНаименованиеЕдиницыВеличины(ЭтотОбъект);
	Код = СформироватьХеш();
КонецПроцедуры

// Для внутреннего использования.
// 
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Код = СформироватьХеш();
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Ссылка", Ссылка);
	
	Дубли = ПоискИУдалениеДублей.НайтиДублиЭлемента("Справочник.ЕдиницыВеличин", ЭтотОбъект, ДополнительныеПараметры);
	Если Дубли.Количество() > 0 Тогда
		Ошибка = НСтр("ru = 'Единица величины с таким обозначением уже существует.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Ошибка, , "Объект.Обозначение", , Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СформироватьХеш()
	ХэшОбозначения = "";
	ВыражениеТЗ = ЭтотОбъект.Выражение.Выгрузить();
	ВыражениеТЗ.Сортировать("БазоваяЕдиница");
	Для каждого Множитель Из ВыражениеТЗ Цикл
		ХэшОбозначения = ХэшОбозначения
			+ РаботаСЕдиницамиВеличинСервер.ПолучитьОбозначениеПриставки(Множитель.Приставка)
			+ РаботаСЕдиницамиВеличинСервер.ПолучитьОбозначениеЕдиницыВеличиныБазовой(Множитель.БазоваяЕдиница)
			+ Множитель.ПоказательСтепени
		;
	КонецЦикла;
	Возврат ХэшОбозначения;
КонецФункции

#КонецОбласти

#КонецЕсли
