#Область Представление

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка) 
	СтандартнаяОбработка = Ложь; 
    Поля.Добавить("Наименование");
    Поля.Добавить("Порядок");
КонецПроцедуры 

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка) 
    СтандартнаяОбработка = Ложь;
    Представление = Данные.Наименование + " (10" + РаботаСоСтрокамиЮникодКлиентСервер.ПолучитьСтрокуИзПоказателяСтепени(Данные.Порядок) + ")";
КонецПроцедуры

#КонецОбласти