
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Сообщение1 = НСтр("ru = 'Широковещательный канал сообщений.'");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЖурналРегистрации(Команда)
	
	ПараметрыФормы = Новый Структура("СобытиеЖурналаРегистрации", НСтр("ru = 'Демо.ОбменСообщениями'"));
	
	ОткрытьФорму("Обработка.ЖурналРегистрации.Форма", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщениеПодписчикам(Команда)
	
	ОтправитьСообщениеПодписчикамНаСервере(Сообщение1);
	
	ПредупреждениеСообщениеОтправлено();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщениеПолучателям(Команда)
	
	ОтправитьСообщениеПолучателямНаСервере(Сообщение1);
	
	ПредупреждениеСообщениеОтправлено();
	
КонецПроцедуры

&НаКлиенте
Процедура ВызватьОшибку(Команда)
	
	ВызватьОшибкуНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ВызватьОшибкуСейчас(Команда)
	
	ВызватьОшибкуНаКлиенте(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПредупреждениеСообщениеОтправлено()
	
	ПоказатьПредупреждение(, НСтр("ru = 'Сообщение отправлено.'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ВызватьОшибкуНаКлиенте(ЭтоБыстроеСообщение = Ложь)
	
	Если Не ЗначениеЗаполнено(Получатель) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Укажите получателя сообщения.'"),, "Получатель");
		Возврат;
	КонецЕсли;
	
	ВызватьОшибкуНаСервере(Получатель, ЭтоБыстроеСообщение);
	
	ПредупреждениеСообщениеОтправлено();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВызватьОшибкуНаСервере(Получатель, ЭтоБыстроеСообщение = Ложь)
	
	НачатьТранзакцию();
	Попытка
		
		Если ЭтоБыстроеСообщение Тогда
			ОбменСообщениями.ОтправитьСообщениеСейчас("УправлениеПроектами\Тест",, Получатель);
		Иначе
			ОбменСообщениями.ОтправитьСообщение("УправлениеПроектами\Тест",, Получатель);
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если ЭтоБыстроеСообщение Тогда
		ОбменСообщениями.ДоставитьСообщения();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтправитьСообщениеПолучателямНаСервере(Сообщение1, ЭтоБыстроеСообщение = Ложь)
	
	НачатьТранзакцию();
	Попытка
		
		Если ЭтоБыстроеСообщение Тогда
			ОбменСообщениями.ОтправитьСообщениеСейчас("ОбщиеСообщения\ТекстовыеСообщения", Сообщение1);
		Иначе
			ОбменСообщениями.ОтправитьСообщение("ОбщиеСообщения\ТекстовыеСообщения", Сообщение1);
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если ЭтоБыстроеСообщение Тогда
		ОбменСообщениями.ДоставитьСообщения();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтправитьСообщениеПодписчикамНаСервере(Сообщение1, ЭтоБыстроеСообщение = Ложь)
	
	НачатьТранзакцию();
	Попытка
		
		Если ЭтоБыстроеСообщение Тогда
			ОбменСообщениями.ОтправитьСообщениеПодписчикамСейчас("ОбщиеСообщения\ТекстовыеСообщения", Сообщение1);
		Иначе
			ОбменСообщениями.ОтправитьСообщениеПодписчикам("ОбщиеСообщения\ТекстовыеСообщения", Сообщение1);
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если ЭтоБыстроеСообщение Тогда
		ОбменСообщениями.ДоставитьСообщения();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
