////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы АИС Метрологическая служба
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Сведения о библиотеке (или конфигурации).

// См. описание в общем модуле ОбновлениеИнформационнойБазыБСП.
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	Описание.Имя = "МетрологическаяСлужба";
	Описание.Версия = "0.1.0.38";
	Описание.РежимВыполненияОтложенныхОбработчиков = "Параллельно";
	Описание.ПараллельноеОтложенноеОбновлениеСВерсии = "0.1.0.0";
	
	// Требуется библиотека стандартных подсистем.
	Описание.ТребуемыеПодсистемы.Добавить("СтандартныеПодсистемы");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики обновления информационной базы.

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
//  Обработчики - ТаблицаЗначений - описание полей, см. в процедуре.
//                ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления.
//
// Пример добавления процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.Версия              = "1.1.0.0";
//  Обработчик.Процедура           = "ОбновлениеИБ.ПерейтиНаВерсию_1_1_0_0";
//  Обработчик.РежимВыполнения     = "Монопольно";
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	// Обработчики, выполняемые при каждом обновлении ИБ.
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.УправлениеОбработчиками = Истина;
	Обработчик.МонопольныйРежим = Истина; // Для демонстрации условного выполнения в монопольном режиме.
	Обработчик.Процедура = "МСОбновлениеИнформационнойБазы.ВыполнятьВсегдаПриСменеВерсии";
	
	// Обработчики, выполняемые при заполнении пустой ИБ.
	//
	
	Обработчик = Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "МСОбновлениеИнформационнойБазы.ПервыйЗапуск";
	
	// Обработчики, выполняемые при заполнении пустой ИБ и при переходе на новую версию.
	//
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "0.1.0.25";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "МСОбновлениеИнформационнойБазы.ВыполнитьПервоначальноеЗаполнениеВалют";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "0.1.0.25";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "МСОбновлениеИнформационнойБазы.ОбновитьПредопределенныеВидыКонтактнойИнформацииОрганизаций";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "0.1.0.25";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "МСОбновлениеИнформационнойБазы.ЗаполнитьКонстантуИспользоватьНесколькоОрганизаций";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "0.1.0.25";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "МСОбновлениеИнформационнойБазы.ОбновитьПредопределенныеВидыКонтактнойИнформации";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.Приоритет = 99;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "0.1.0.25";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.Процедура = "МСОбновлениеИнформационнойБазы.ОбновитьПредопределенныеКлючевыеОперации";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "0.1.0.25";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "МСОбновлениеИнформационнойБазы.ИнициализироватьРолиИсполнителей";
	
	Если Не ОбщегоНазначенияПовтИсп.РазделениеВключено() И Не ОбменДаннымиПовтИсп.ЭтоАвтономноеРабочееМесто() Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "*";
		Обработчик.Процедура = "МСОбновлениеИнформационнойБазы.ЗагрузитьДополнительныеОтчетыИОбработкиИзОбщихМакетов";
		Обработчик.РежимВыполнения = "Оперативно";
	КонецЕсли;
	
	// Обработчики, выполняемые при переходе на новую версию.
	//
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.0.1.5";
	Обработчик.Процедура = "МСОбновлениеИнформационнойБазы.ОбновитьДополнительныеОбработки_2_0_1_5";
	
	// Обработчики оперативного обновления.
	//
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "0.1.0.25";
	Обработчик.Процедура = "МСОбновлениеИнформационнойБазы.ЗаполнитьКонстантыДляОрганизаций";
	Обработчик.РежимВыполнения = "Оперативно";
	
	// Обработчики отложенного обновления.
	//
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = Метаданные.Версия; // для целей тестирования
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("b3be66c5-708d-42c8-a019-818036d09d06");
	Обработчик.Процедура = "Документы._ДемоЗаказПокупателя.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение значения нового реквизита ""Статус заказа"" у документов ""Демо: Заказ покупателя"" прошлых периодов.
		|До завершения обработки ""Статус заказа"" данных документов будет отображаться некорректно.'");
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.ОчередьОтложеннойОбработки = 1;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "Документы._ДемоЗаказПокупателя.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ЧитаемыеОбъекты      = "Документ._ДемоЗаказПокупателя";
	Обработчик.ИзменяемыеОбъекты    = "Документ._ДемоЗаказПокупателя";
	Обработчик.ПроцедураПроверки    = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.БлокируемыеОбъекты   = "Документ._ДемоЗаказПокупателя, Отчет._ДемоСтатусыЗаказовПокупателей";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "0.1.0.25";
	Обработчик.Процедура = "МСОбновлениеИнформационнойБазы.ЗаполнитьРеквизитГруппаДоступаУСправочниковГруппЗначенийДоступа";
	Обработчик.РежимВыполнения = "Оперативно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "0.1.0.25";
	Обработчик.Процедура = "МСОбновлениеИнформационнойБазы.ОбновитьПредопределенныеВидыКонтактнойИнформацииФизическихЛиц";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.Приоритет = 99;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "0.1.0.25";
	Обработчик.Процедура = "МСОбновлениеИнформационнойБазы.ОбновитьПредопределенныеВидыКонтактнойИнформацииКонтрагентов";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.Приоритет = 99;
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "0.1.0.25";
	Обработчик.Процедура = "МСОбновлениеИнформационнойБазы.ОбновитьПредопределенныйВидКонтактнойИнформации";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.Приоритет = 99;
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Оперативно";
	Обработчик.Версия    = "0.1.0.25";
	Обработчик.Процедура = "МСОбновлениеИнформационнойБазы.СброситьНастройкиОтчетов";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия    = "0.1.0.25";
	Обработчик.Процедура = "МСОбновлениеИнформационнойБазы.ОбновитьИспользованиеКонтактнойИнформацииКонтактныхЛицПартнеров";
	Обработчик.РежимВыполнения = "Оперативно";
	Обработчик.ОбщиеДанные      = Ложь;
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия    = "0.1.0.25";
	Обработчик.Процедура = "МСОбновлениеИнформационнойБазы.ОбновитьИспользованиеНаборовСвойствВнешнихПользователей";
	Обработчик.РежимВыполнения = "Оперативно";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия    = "0.1.0.25";
	Обработчик.Процедура = "МСОбновлениеИнформационнойБазы.ОбновитьПорядокВидовКонтактнойИнформацииКонтрагентов";
	Обработчик.РежимВыполнения = "Оперативно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия    = "0.1.0.25";
	Обработчик.Процедура = "МСОбновлениеИнформационнойБазы.УстановитьНазначенияРолейИсполнителей";
	Обработчик.РежимВыполнения = "Оперативно";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "0.1.0.25";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("423736c1-7be4-439d-bb61-3a420cbc09c0");
	Обработчик.Процедура = "МСОбновлениеИнформационнойБазы.ЗаполнитьКонтактнуюИнформациюДляСписков";
	Обработчик.Комментарий = НСтр("ru = 'Добавление контактной информации в списки и отчеты.
		|Если в списках и отчетах добавить новые колонки с контактной информацией, то до завершения этой процедуры обработки они будут незаполненными.'");
	Обработчик.РежимВыполнения = "Отложенно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия    = "0.1.0.25";
	Обработчик.Процедура = "МСОбновлениеИнформационнойБазы.ВключитьОграничениеПоПартнерамПриИспользованииВнешнихПользователей";
	Обработчик.РежимВыполнения = "Оперативно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия    = "0.1.0.25";
	Обработчик.Процедура = "МСОбновлениеИнформационнойБазы.НастроитьИсториюКонтактнойИнформацииИМногострочноеПоле";
	Обработчик.РежимВыполнения = "Оперативно";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "0.1.0.25";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("AFB1DC88-66C3-4fd6-9C6F-766669FEBAC4");
	Обработчик.Процедура = "МСОбновлениеИнформационнойБазы.ОбновитьНаборыЗначенийДоступаЗаданийСРолевойАдресацией";
	Обработчик.Комментарий = НСтр("ru = 'Обновление прав доступа для бизнес-процесса ""Демо: Задание"". 
		|До завершения обработки будут действовать прежние права доступа к заданиям.'");
	Обработчик.РежимВыполнения = "Отложенно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "0.1.0.25";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("260e546d-4032-44be-9889-c5eb67fb4cc0");
	Обработчик.Процедура = "МСОбновлениеИнформационнойБазы.ОбновитьКонтактнуюИнформациюЗаказовПокупателя";
	Обработчик.Комментарий = НСтр("ru = 'Для документов ""Демо: Заказ покупателя"" заполняет реквизиты
		|АдресДоставкиСтрокой и ЭлектроннаяПочтаСтрокой.'");
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.ПроцедураПроверки = "МСОбновлениеИнформационнойБазы.ЗаполненыДанныеДляСпискаЗаказПокупателя";
	Обработчик.БлокируемыеОбъекты = "Документ._ДемоЗаказПокупателя, Отчет._ДемоСтатусыЗаказовПокупателей";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "0.1.0.25";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("c23af8c2-b345-4d76-a50b-2f64bf78a1af");
	Обработчик.Процедура = "РегистрыСведений._ДемоРеестрСкладскихДокументов.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Комментарий =
		НСтр("ru = 'Заполнение реестра складских документов.
		           |До завершения обработки реестр складских документов может быть неполным.'");
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.ОчередьОтложеннойОбработки = 1;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыСведений._ДемоРеестрСкладскихДокументов.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ЧитаемыеОбъекты      = "Документ._ДемоОприходованиеТоваров, Документ._ДемоПеремещениеТоваров, Документ._ДемоСписаниеТоваров";
	Обработчик.ИзменяемыеОбъекты    = "РегистрСведений._ДемоРеестрСкладскихДокументов";
	Обработчик.ПроцедураПроверки    = "ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "0.1.0.25";
	Обработчик.Процедура           = "МСОбновлениеИнформационнойБазы.ЗаполнитьШаблоныСообщений";
	Обработчик.РежимВыполнения     = "Оперативно";
	Обработчик.НачальноеЗаполнение = Истина;
	
КонецПроцедуры

// Вызывается перед процедурами-обработчиками обновления данных ИБ.
//
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
КонецПроцедуры

// Вызывается после завершения обновления данных ИБ.
// 
// Параметры:
//   ПредыдущаяВерсия       - Строка - версия до обновления. "0.0.0.0" для "пустой" ИБ.
//   ТекущаяВерсия          - Строка - версия после обновления.
//   ВыполненныеОбработчики - ДеревоЗначений - список выполненных процедур-обработчиков обновления,
//                                             сгруппированных по номеру версии.
//   ВыводитьОписаниеОбновлений - Булево - если установить Истина, то будет выведена форма
//                                с описанием обновлений. По умолчанию, Истина.
//                                Возвращаемое значение.
//   МонопольныйРежим           - Булево - Истина, если обновление выполнялось в монопольном режиме.
//
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
		Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
	
КонецПроцедуры

// Вызывается при подготовке табличного документа с описанием изменений в программе.
//
// Параметры:
//   Макет - ТабличныйДокумент - описание обновления всех библиотек и конфигурации.
//           Макет можно дополнить или заменить.
//           См. также общий макет ОписаниеИзмененийСистемы.
//
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	
КонецПроцедуры

// Позволяет переопределить режим обновления данных информационной базы.
// Для использования в редких (нештатных) случаях перехода, не предусмотренных в
// стандартной процедуре определения режима обновления.
//
// Параметры:
//   РежимОбновленияДанных - Строка - в обработчике можно присвоить одно из значений:
//              "НачальноеЗаполнение"     - если это первый запуск пустой базы (области данных);
//              "ОбновлениеВерсии"        - если выполняется первый запуск после обновление конфигурации базы данных;
//              "ПереходСДругойПрограммы" - если выполняется первый запуск после обновление конфигурации базы данных, 
//                                          в которой изменилось имя основной конфигурации.
//
//   СтандартнаяОбработка  - Булево - если присвоить Ложь, то стандартная процедура
//                                    определения режима обновления не выполняется, 
//                                    а используется значение РежимОбновленияДанных.
//
Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Добавляет в список процедуры-обработчики перехода с другой программы (с другим именем конфигурации).
// Например, для перехода между разными, но родственными конфигурациями: базовая -> проф -> корп.
// Вызывается перед началом обновления данных ИБ.
//
// Параметры:
//  Обработчики - ТаблицаЗначений - с колонками:
//    * ПредыдущееИмяКонфигурации - Строка - имя конфигурации, с которой выполняется переход;
//                                           или "*", если нужно выполнять при переходе с любой конфигурации.
//    * Процедура                 - Строка - полное имя процедуры-обработчика перехода с программы
//                                           ПредыдущееИмяКонфигурации.
//                                  Например, "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику"
//                                  Обязательно должна быть экспортной.
//
// Пример добавления процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.ПредыдущееИмяКонфигурации  = "УправлениеТорговлей";
//  Обработчик.Процедура                  = "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику";
//
Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.ПредыдущееИмяКонфигурации = "БиблиотекаСтандартныхПодсистемДемоБазовая";
	Обработчик.Процедура = "МСОбновлениеИнформационнойБазы.ПерейтиСБазовойВерсииНаПРОФ";
	
КонецПроцедуры

// Вызывается после выполнения всех процедур-обработчиков перехода с другой программы (с другим именем конфигурации),
// и до начала выполнения обновления данных ИБ.
//
// Параметры:
//  ПредыдущееИмяКонфигурации    - Строка - имя конфигурации до перехода.
//  ПредыдущаяВерсияКонфигурации - Строка - имя предыдущей конфигурации (до перехода).
//  Параметры                    - Структура - 
//    * ВыполнитьОбновлениеСВерсии   - Булево - по умолчанию Истина. Если установить Ложь, 
//        то будут выполнена только обязательные обработчики обновления (с версией "*").
//    * ВерсияКонфигурации           - Строка - номер версии после перехода. 
//        По умолчанию, равен значению версии конфигурации в свойствах метаданных.
//        Для того чтобы выполнить, например, все обработчики обновления с версии ПредыдущаяВерсияКонфигурации, 
//        следует установить значение параметра в ПредыдущаяВерсияКонфигурации.
//        Для того чтобы выполнить вообще все обработчики обновления, установить значение "0.0.0.1".
//    * ОчиститьСведенияОПредыдущейКонфигурации - Булево - по умолчанию Истина. 
//        Для случаев когда предыдущая конфигурация совпадает по имени с подсистемой текущей конфигурации, следует
//        указать Ложь.
//
Процедура ПриЗавершенииПереходаСДругойПрограммы(Знач ПредыдущееИмяКонфигурации, 
	Знач ПредыдущаяВерсияКонфигурации, Параметры) Экспорт
	
	Если ПредыдущееИмяКонфигурации = "ПредыдущееИмяКонфигурацииБазовая" Тогда
		Параметры.ВерсияКонфигурации = ПредыдущаяВерсияКонфигурации;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Заполнение пустой ИБ

// Демонстрирует процедуру-обработчик обновления и первоначального заполнения
// данных ИБ, которая выполняется однократно при переходе на версию 1.0.0.0.
//
Процедура ПервыйЗапуск() Экспорт
	
	// Код для первоначального заполнения информационной базы.
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обновление ИБ

// Демонстрирует процедуру-обработчик обновления данных ИБ, 
// которая выполняется каждый раз при смене версии конфигурации.
//
Процедура ВыполнятьВсегдаПриСменеВерсии(Параметры = Неопределено) Экспорт
	
	Если Параметры <> Неопределено И НЕ Параметры.МонопольныйРежим Тогда
		Параметры.МонопольныйРежим = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ОбновлениеИБ", "ВыполнятьМонопольноеОбновление", Ложь);
	КонецЕсли;
	
КонецПроцедуры

// Демо-пример установки значений реквизитов предопределенных элементов справочника.
// РолиИсполнителей.
//
Процедура ИнициализироватьРолиИсполнителей() Экспорт
	
	РольОбъект = Справочники.РолиИсполнителей._ДемоРуководительКомпании.ПолучитьОбъект();
	РольОбъект.ИспользуетсяБезОбъектовАдресации = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(РольОбъект);
	
	РольОбъект = Справочники.РолиИсполнителей._ДемоГлавныйБухгалтер.ПолучитьОбъект();
	РольОбъект.ИспользуетсяБезОбъектовАдресации = Истина;
	РольОбъект.ИспользуетсяСОбъектамиАдресации = Истина;
	РольОбъект.ТипыОсновногоОбъектаАдресации = ПланыВидовХарактеристик.ОбъектыАдресацииЗадач._ДемоОрганизация;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(РольОбъект);
	
	РольОбъект = Справочники.РолиИсполнителей._ДемоРуководительПодразделения.ПолучитьОбъект();
	РольОбъект.ИспользуетсяСОбъектамиАдресации = Истина;
	РольОбъект.ТипыОсновногоОбъектаАдресации = ПланыВидовХарактеристик.ОбъектыАдресацииЗадач._ДемоПодразделение;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(РольОбъект);
	
КонецПроцедуры

// Процедура выполняет заполнение справочника Валюты для новой области данных.
//
Процедура ВыполнитьПервоначальноеЗаполнениеВалют() Экспорт
	
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		СписокВалют = Новый Массив; 
		СписокВалют.Добавить("840");
		СписокВалют.Добавить("643");
		СписокВалют.Добавить("978");
		
		Ссылки = РаботаСКурсамиВалют.ДобавитьВалютыПоКоду(СписокВалют);
		
	КонецЕсли;

КонецПроцедуры

// Вызывается при переходе на версию конфигурации 2.1.3.16.
//
Процедура ОбновитьПредопределенныеВидыКонтактнойИнформацииОрганизаций() Экспорт
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Адрес");
	ПараметрыВида.Вид = "_ДемоЮридическийАдресОрганизации";
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.Порядок = 1;
	ПараметрыВида.НастройкиПроверки.АдресТолькоРоссийский = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Адрес");
	ПараметрыВида.Вид = "_ДемоФактическийАдресОрганизации";
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.Порядок = 2;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Телефон");
	ПараметрыВида.Вид = "_ДемоТелефонОрганизации";
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	ПараметрыВида.Порядок = 3;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Факс");
	ПараметрыВида.Вид = "_ДемоФаксОрганизации";
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	ПараметрыВида.Порядок = 4;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("АдресЭлектроннойПочты");
	ПараметрыВида.Вид = "_ДемоEmailОрганизации";
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	ПараметрыВида.Порядок = 5;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Адрес");
	ПараметрыВида.Вид = "_ДемоПочтовыйАдресОрганизации";
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.Порядок = 6;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Другое");
	ПараметрыВида.Вид = "_ДемоДругаяИнформацияОрганизации";
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.Порядок = 7;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
КонецПроцедуры

// Вызывается при переходе на версию БСП 2.2.1.12.
//
Процедура ЗаполнитьКонстантуИспользоватьНесколькоОрганизаций() Экспорт
	
	Если Константы._ДемоИспользоватьНесколькоОрганизаций.Получить() =
		Константы._ДемоНеИспользоватьНесколькоОрганизаций.Получить() Тогда
		// Опции должны иметь противоположные значения.
		// Если это не так, то значит в ИБ раньше не было этих опций - инициализируем их значения.
		Константы._ДемоИспользоватьНесколькоОрганизаций.Установить(Справочники._ДемоОрганизации.КоличествоОрганизаций() > 1);
	КонецЕсли;
	
КонецПроцедуры

// Конвертация имен разделов на ссылки справочника ИОМ 
// для подсистемы "Дополнительные отчеты и обработки".
//
Процедура ОбновитьДополнительныеОбработки_2_0_1_5() Экспорт
	СоответствиеИменКомандРазделам = Новый Соответствие;
	
	СоответствиеИменКомандРазделам.Вставить(
		"_ДемоДополнительныеОбработкиРабочийСтол", 
		ДополнительныеОтчетыИОбработкиКлиентСервер.ИдентификаторРабочегоСтола());
	
	СоответствиеИменКомандРазделам.Вставить(
		"_ДемоДополнительныеОбработкиАдминистрирование", 
		Метаданные.Подсистемы.Администрирование);
	
	СоответствиеИменКомандРазделам.Вставить(
		"_ДемоДополнительныеОбработкиИнтегрируемыеПодсистемы", 
		Метаданные.Подсистемы._ДемоИнтегрируемыеПодсистемы);
	
	СоответствиеИменКомандРазделам.Вставить(
		"_ДемоДополнительныеОтчетыРабочийСтол", 
		ДополнительныеОтчетыИОбработкиКлиентСервер.ИдентификаторРабочегоСтола());
	
	СоответствиеИменКомандРазделам.Вставить(
		"_ДемоДополнительныеОтчетыАдминистрирование", 
		Метаданные.Подсистемы.Администрирование);
	
	СоответствиеИменКомандРазделам.Вставить(
		"_ДемоДополнительныеОтчетыИнтегрируемыеПодсистемы", 
		Метаданные.Подсистемы._ДемоИнтегрируемыеПодсистемы);
	
	ДополнительныеОтчетыИОбработки.ЗаменитьИменаРазделовНаИдентификаторы(СоответствиеИменКомандРазделам);
КонецПроцедуры

// Демонстрирует процедуру-обработчик обновления и первоначального заполнения
// данных ИБ, которая выполняет обновление данных подсистемы "Дополнительные отчеты и обработки"
// из-за изменения состава и формата вызова обработок.
//
Процедура ЗагрузитьДополнительныеОтчетыИОбработкиИзОбщихМакетов() Экспорт
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Возврат;
	#КонецЕсли
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеОтчетыИОбработки") Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкиИзМакетов = Новый ТаблицаЗначений();
	ОбработкиИзМакетов.Колонки.Добавить("ИмяМакета",           Новый ОписаниеТипов("Строка"));
	ОбработкиИзМакетов.Колонки.Добавить("АктуальноеИмяФайла",  Новый ОписаниеТипов("Строка"));
	ОбработкиИзМакетов.Колонки.Добавить("СтарыеИменаОбъектов", Новый ОписаниеТипов("Массив"));
	ОбработкиИзМакетов.Колонки.Добавить("СтарыеИменаФайлов",   Новый ОписаниеТипов("Массив"));
	
	// Отчеты.
	
	СтрокаТаблицы = ОбработкиИзМакетов.Добавить();
	СтрокаТаблицы.ИмяМакета          = "_ДемоОтчетПоСчетамНаОплатуГлобальный";
	СтрокаТаблицы.АктуальноеИмяФайла = СтрокаТаблицы.ИмяМакета + ".erf";
	СтрокаТаблицы.СтарыеИменаОбъектов.Добавить("ГлобальныйОтчет");
	СтрокаТаблицы.СтарыеИменаОбъектов.Добавить("_ДемоДополнительныйОтчет");
	СтрокаТаблицы.СтарыеИменаФайлов.Добавить("ГлобальныйОтчет.erf");
	СтрокаТаблицы.СтарыеИменаФайлов.Добавить("_ДемоДополнительныйОтчет.erf");
	СтрокаТаблицы.СтарыеИменаФайлов.Добавить("ДополнительныйОтчет.erf");
	
	СтрокаТаблицы = ОбработкиИзМакетов.Добавить();
	СтрокаТаблицы.ИмяМакета          = "_ДемоОтчетПоСчетамНаОплатуКонтекстный";
	СтрокаТаблицы.АктуальноеИмяФайла = СтрокаТаблицы.ИмяМакета + ".erf";
	СтрокаТаблицы.СтарыеИменаОбъектов.Добавить("Отчет");
	СтрокаТаблицы.СтарыеИменаОбъектов.Добавить("_ДемоКонтекстныйОтчет");
	СтрокаТаблицы.СтарыеИменаОбъектов.Добавить("_ДемоДополнительныйОтчетНазначаемый");
	СтрокаТаблицы.СтарыеИменаОбъектов.Добавить("_ДемоДополнительныйОтчетКонтекстный");
	СтрокаТаблицы.СтарыеИменаФайлов.Добавить("Отчет.erf");
	СтрокаТаблицы.СтарыеИменаФайлов.Добавить("_ДемоДополнительныйОтчетНазначаемый.erf");
	СтрокаТаблицы.СтарыеИменаФайлов.Добавить("КонтекстныйОтчет.erf");
	
	// Обработки.
	
	СтрокаТаблицы = ОбработкиИзМакетов.Добавить();
	СтрокаТаблицы.ИмяМакета          = "_ДемоУправлениеПолнотекстовымПоиском";
	СтрокаТаблицы.АктуальноеИмяФайла = СтрокаТаблицы.ИмяМакета + ".epf";
	СтрокаТаблицы.СтарыеИменаОбъектов.Добавить("ГлобальнаяОбработка");
	СтрокаТаблицы.СтарыеИменаОбъектов.Добавить("_ДемоДополнительнаяОбработка");
	СтрокаТаблицы.СтарыеИменаФайлов.Добавить("ГлобальнаяОбработка.epf");
	СтрокаТаблицы.СтарыеИменаФайлов.Добавить("_ДемоДополнительнаяОбработка.epf");
	СтрокаТаблицы.СтарыеИменаФайлов.Добавить("ДополнительнаяОбработка.epf");
	
	СтрокаТаблицы = ОбработкиИзМакетов.Добавить();
	СтрокаТаблицы.ИмяМакета         = "_ДемоЗаполнениеКонтрагентов";
	СтрокаТаблицы.АктуальноеИмяФайла = СтрокаТаблицы.ИмяМакета + ".epf";
	СтрокаТаблицы.СтарыеИменаОбъектов.Добавить("ЗаполнениеОбъекта");
	СтрокаТаблицы.СтарыеИменаОбъектов.Добавить("_ДемоДополнительнаяОбработкаЗаполненияНазначаемая");
	СтрокаТаблицы.СтарыеИменаФайлов.Добавить("_ДемоДополнительнаяОбработкаЗаполненияНазначаемая.epf");
	СтрокаТаблицы.СтарыеИменаФайлов.Добавить("ЗаполнениеОбъекта.epf");
	
	СтрокаТаблицы = ОбработкиИзМакетов.Добавить();
	СтрокаТаблицы.ИмяМакета           = "_ДемоЗагрузкаЮридическихЛицКонтрагентов";
	СтрокаТаблицы.АктуальноеИмяФайла  = СтрокаТаблицы.ИмяМакета + ".epf";
	СтрокаТаблицы.СтарыеИменаОбъектов.Добавить("_ДемоДополнительнаяОбработкаЗагрузкаИзФайла");
	СтрокаТаблицы.СтарыеИменаФайлов.Добавить("_ДемоДополнительнаяОбработкаЗагрузкаИзФайла.epf");
	СтрокаТаблицы.СтарыеИменаФайлов.Добавить("ЗагрузкаКонтрагентовИзФайла.epf");
	
	СтрокаТаблицы = ОбработкиИзМакетов.Добавить();
	СтрокаТаблицы.ИмяМакета          = "_ДемоПечатьСписанийТоваровСИспользованиемМакетаMSWord";
	СтрокаТаблицы.АктуальноеИмяФайла = СтрокаТаблицы.ИмяМакета + ".epf";
	СтрокаТаблицы.СтарыеИменаОбъектов.Добавить("ПечатнаяФорма");
	СтрокаТаблицы.СтарыеИменаОбъектов.Добавить("_ДемоДополнительнаяОбработкаПечатиMSWordНазначаемая");
	СтрокаТаблицы.СтарыеИменаФайлов.Добавить("_ДемоДополнительнаяОбработкаПечатиMSWordНазначаемая.epf");
	СтрокаТаблицы.СтарыеИменаФайлов.Добавить("Печать_MSWord_OO.epf");
	СтрокаТаблицы.СтарыеИменаФайлов.Добавить("Печать_Word.epf");
	
	СтрокаТаблицы = ОбработкиИзМакетов.Добавить();
	СтрокаТаблицы.ИмяМакета          = "_ДемоПечатьСчетовНаОплатуПокупателю";
	СтрокаТаблицы.АктуальноеИмяФайла = СтрокаТаблицы.ИмяМакета + ".epf";
	СтрокаТаблицы.СтарыеИменаОбъектов.Добавить("ПечатнаяФорма");
	СтрокаТаблицы.СтарыеИменаОбъектов.Добавить("_ДемоДополнительнаяОбработкаПечатиMXLНазначаемая");
	СтрокаТаблицы.СтарыеИменаФайлов.Добавить("_ДемоДополнительнаяОбработкаПечатиMXLНазначаемая.epf");
	СтрокаТаблицы.СтарыеИменаФайлов.Добавить("Печать_MXL.epf");
	
	СтрокаТаблицы = ОбработкиИзМакетов.Добавить();
	СтрокаТаблицы.ИмяМакета          = "_ДемоВводНаОснованииОприходованийТоваров";
	СтрокаТаблицы.АктуальноеИмяФайла = СтрокаТаблицы.ИмяМакета + ".epf";
	СтрокаТаблицы.СтарыеИменаОбъектов.Добавить("СоздатьНаОсновании");
	СтрокаТаблицы.СтарыеИменаОбъектов.Добавить("_ДемоДополнительнаяОбработкаСозданияСвязанныхОбъектовНазначаемая");
	СтрокаТаблицы.СтарыеИменаФайлов.Добавить("_ДемоДополнительнаяОбработкаСозданияСвязанныхОбъектовНазначаемая.epf");
	СтрокаТаблицы.СтарыеИменаФайлов.Добавить("СозданиеСвязанныхОбъектов.epf");
	
	СтрокаТаблицы = ОбработкиИзМакетов.Добавить();
	СтрокаТаблицы.ИмяМакета          = "_ДемоЗагрузкаНоменклатурыИзПрайсЛистаПрофилиБезопасности";
	СтрокаТаблицы.АктуальноеИмяФайла = СтрокаТаблицы.ИмяМакета + ".epf";
	СтрокаТаблицы.СтарыеИменаОбъектов.Добавить("ЗагрузкаПрайсЛиста");
	СтрокаТаблицы.СтарыеИменаОбъектов.Добавить("_ДемоДополнительнаяОбработкаЗагрузкаПрайсЛиста");
	СтрокаТаблицы.СтарыеИменаОбъектов.Добавить("_ДемоДополнительнаяОбработкаЗагрузкаПрайсЛистаСПрофилем");
	СтрокаТаблицы.СтарыеИменаФайлов.Добавить("ЗагрузкаПрайсЛиста.epf");
	СтрокаТаблицы.СтарыеИменаФайлов.Добавить("_ДемоДополнительнаяОбработкаЗагрузкаПрайсЛиста.epf");
	СтрокаТаблицы.СтарыеИменаФайлов.Добавить("_ДемоДополнительнаяОбработкаЗагрузкаПрайсЛистаСПрофилем.epf");
	
	СтрокаТаблицы = ОбработкиИзМакетов.Добавить();
	СтрокаТаблицы.ИмяМакета          = "_ДемоЗагрузкаНоменклатурыИзПрайсЛистаСценарноеВыполнение";
	СтрокаТаблицы.АктуальноеИмяФайла = СтрокаТаблицы.ИмяМакета + ".epf";
	СтрокаТаблицы.СтарыеИменаОбъектов.Добавить("_ДемоДополнительнаяОбработкаЗагрузкаПрайсЛистаВБезопасномРежиме");
	СтрокаТаблицы.СтарыеИменаФайлов.Добавить("ЗагрузкаПрайсЛистаВБезопасномРежиме.epf");
	СтрокаТаблицы.СтарыеИменаФайлов.Добавить("_ДемоДополнительнаяОбработкаЗагрузкаПрайсЛистаВБезопасномРежиме.epf");
	СтрокаТаблицы.СтарыеИменаФайлов.Добавить("ЗагрузкаНоменклатурыИзПрайсЛистаСоСценарием.epf");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДополнительныеОтчетыИОбработки.Ссылка,
	|	ДополнительныеОтчетыИОбработки.Версия,
	|	ДополнительныеОтчетыИОбработки.ИмяОбъекта,
	|	ДополнительныеОтчетыИОбработки.ИмяФайла
	|ИЗ
	|	Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки";
	
	ОбработкиИзКонфигурации = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ОбработкаКонфигурации Из ОбработкиИзКонфигурации Цикл
		ОбработкаКонфигурации.ИмяОбъекта = ВРег(ОбработкаКонфигурации.ИмяОбъекта);
		ОбработкаКонфигурации.ИмяФайла   = ВРег(ОбработкаКонфигурации.ИмяФайла);
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы Из ОбработкиИзМакетов Цикл
		СтрокаТаблицы.СтарыеИменаФайлов.Вставить(0, СтрокаТаблицы.АктуальноеИмяФайла);
		СтрокаТаблицы.СтарыеИменаОбъектов.Вставить(0, СтрокаТаблицы.ИмяМакета);
		Расширение = Сред(СтрокаТаблицы.АктуальноеИмяФайла, СтрНайти(СтрокаТаблицы.АктуальноеИмяФайла, ".")+1);
		
		НайденнаяСсылка = Неопределено;
		Для Каждого ИмяФайла Из СтрокаТаблицы.СтарыеИменаФайлов Цикл
			НайденнаяСтрока = ОбработкиИзКонфигурации.Найти(ВРег(ИмяФайла), "ИмяФайла");
			Если НайденнаяСтрока <> Неопределено Тогда
				НайденнаяСсылка = НайденнаяСтрока.Ссылка;
				ОбработкиИзКонфигурации.Удалить(НайденнаяСтрока);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если НайденнаяСсылка = Неопределено Тогда
			Для Каждого ИмяОбъекта Из СтрокаТаблицы.СтарыеИменаОбъектов Цикл
				НайденнаяСтрока = ОбработкиИзКонфигурации.Найти(ВРег(ИмяОбъекта), "ИмяОбъекта");
				Если НайденнаяСтрока <> Неопределено Тогда
					НайденнаяСсылка = НайденнаяСтрока.Ссылка;
					ОбработкиИзКонфигурации.Удалить(НайденнаяСтрока);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если НайденнаяСсылка = Неопределено Тогда
			СправочникОбъект = Справочники.ДополнительныеОтчетыИОбработки.СоздатьЭлемент();
			СправочникОбъект.ИспользоватьДляФормыОбъекта = Истина;
			СправочникОбъект.ИспользоватьДляФормыСписка  = Истина;
			СправочникОбъект.Ответственный               = Пользователи.ТекущийПользователь();
		Иначе
			СправочникОбъект = НайденнаяСсылка.ПолучитьОбъект();
		КонецЕсли;
		
		ДвоичныеДанные    = ПолучитьОбщийМакет(СтрокаТаблицы.ИмяМакета);
		АдресДанных       = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
		Менеджер          = ?(Расширение = "erf", ВнешниеОтчеты, ВнешниеОбработки);
		ИмяОбъекта        = Менеджер.Подключить(АдресДанных, , Истина);
		ВнешнийОбъект     = Менеджер.Создать(ИмяОбъекта);
		ОбработкаСведения = ВнешнийОбъект.СведенияОВнешнейОбработке();
		
		Если Не СправочникОбъект.ЭтоНовый()
			И ВерсияЧислом(СправочникОбъект.Версия) >= ВерсияЧислом(ОбработкаСведения.Версия)
			И ОбработкаСведения.Версия <> Метаданные.Версия Тогда
			Продолжить;
		КонецЕсли;
		
		ВнешнийОбъектМетаданные = ВнешнийОбъект.Метаданные();
		Если ОбработкаСведения.Наименование = Неопределено ИЛИ ОбработкаСведения.Информация = Неопределено Тогда
			Если ОбработкаСведения.Наименование = Неопределено Тогда
				ОбработкаСведения.Наименование = ВнешнийОбъектМетаданные.Представление();
			КонецЕсли;
			Если ОбработкаСведения.Информация = Неопределено Тогда
				ОбработкаСведения.Информация = ВнешнийОбъектМетаданные.Комментарий;
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СправочникОбъект, ОбработкаСведения, "Наименование, БезопасныйРежим, Версия, Информация");
		
		// Выгрузка настроек команд, которые переопределяются администратором.
		ПоискЗаданий = Новый Соответствие;
		Для Каждого СтараяКоманда Из СправочникОбъект.Команды Цикл
			Если ЗначениеЗаполнено(СтараяКоманда.РегламентноеЗаданиеGUID) Тогда
				ПоискЗаданий.Вставить(ВРег(СтараяКоманда.Идентификатор), СтараяКоманда.РегламентноеЗаданиеGUID);
			КонецЕсли;
		КонецЦикла;
		
		ПараметрыРегистрации = Новый Структура;
		ПараметрыРегистрации.Вставить("АдресДанныхОбработки", АдресДанных);
		ПараметрыРегистрации.Вставить("ЭтоОтчет", ВРег(Расширение) = "ERF");
		ПараметрыРегистрации.Вставить("ОтключатьКонфликтующие", Ложь);
		ПараметрыРегистрации.Вставить("ИмяФайла", СтрокаТаблицы.АктуальноеИмяФайла);
		ПараметрыРегистрации.Вставить("ОтключатьПубликацию", Ложь);
		
		СправочникОбъект.ИмяОбъекта = Неопределено;
		СправочникОбъект.Публикация = Перечисления.ВариантыПубликацииДополнительныхОтчетовИОбработок.Используется;
		СправочникОбъект.Вид        = ДополнительныеОтчетыИОбработки.ПолучитьВидОбработкиПоСтроковомуПредставлениюВида(
			ОбработкаСведения.Вид);
		
		Результат = ДополнительныеОтчетыИОбработки.ЗарегистрироватьОбработку(СправочникОбъект, ПараметрыРегистрации);
		Если Не Результат.Успех И Результат.ИмяОбъектаЗанято Тогда
			ПараметрыРегистрации.Вставить("ОтключатьКонфликтующие", Истина);
			ПараметрыРегистрации.Вставить("Конфликтующие", Результат.Конфликтующие);
			Результат = ДополнительныеОтчетыИОбработки.ЗарегистрироватьОбработку(СправочникОбъект, ПараметрыРегистрации);
		КонецЕсли;
		Если Не Результат.Успех Тогда
			Если Результат.ИмяОбъектаЗанято Тогда
				Результат.ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Имя ""%1"" занято объектами ""%2""'"),
					ИмяОбъекта,
					Строка(Результат.Конфликтующие));
			КонецЕсли;
			ЗаписьЖурналаРегистрации(
				ДополнительныеОтчетыИОбработкиКлиентСервер.НаименованиеПодсистемы(Ложь),
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.ОбщиеМакеты.Найти(СтрокаТаблицы.ИмяМакета),
				,
				Результат.ТекстОшибки);
			Продолжить;
		КонецЕсли;
		
		СправочникОбъект.ХранилищеОбработки = Новый ХранилищеЗначения(ДвоичныеДанные);
		СправочникОбъект.ИмяОбъекта         = ВнешнийОбъектМетаданные.Имя;
		СправочникОбъект.ИмяФайла           = СтрокаТаблицы.АктуальноеИмяФайла;
		
		// Очистка и загрузка новых команд.
		Для Каждого Команда Из СправочникОбъект.Команды Цикл
			РегламентноеЗаданиеGUID = ПоискЗаданий.Получить(ВРег(Команда.Идентификатор));
			Если РегламентноеЗаданиеGUID <> Неопределено Тогда
				Команда.РегламентноеЗаданиеGUID = РегламентноеЗаданиеGUID;
				ПоискЗаданий.Удалить(ВРег(Команда.Идентификатор));
			КонецЕсли;
		КонецЦикла;
		
		// Удаление неактуальных заданий.
		Для Каждого КлючИЗначение Из ПоискЗаданий Цикл
			Попытка
				Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(КлючИЗначение.Значение);
				Задание.Удалить();
			Исключение
				ЗаписьЖурналаРегистрации(
					ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
					УровеньЖурналаРегистрации.Ошибка,
					Метаданные.Справочники.ДополнительныеОтчетыИОбработки,
					СправочникОбъект.Ссылка,
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Ошибка при удалении задания ""%1"":%2'"),
						КлючИЗначение.Значение,
						Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
			КонецПопытки;
		КонецЦикла;
		
		Если ДополнительныеОтчетыИОбработки.ПроверитьГлобальнаяОбработка(СправочникОбъект.Вид) Тогда
			ТаблицаОбъектовМетаданных = ДополнительныеОтчетыИОбработки.ПодключенныеОбъектыМетаданных(СправочникОбъект.Вид);
			Для Каждого СтрокаТаблицы Из ТаблицаОбъектовМетаданных Цикл
				РазделСсылка = СтрокаТаблицы.Ссылка;
				СтрокаРаздела = СправочникОбъект.Разделы.Найти(РазделСсылка, "Раздел");
				Если СтрокаРаздела = Неопределено Тогда
					СтрокаРаздела = СправочникОбъект.Разделы.Добавить();
					СтрокаРаздела.Раздел = РазделСсылка;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Для Каждого ОписаниеНазначения Из ОбработкаСведения.Назначение Цикл
				ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ОписаниеНазначения);
				Если ОбъектМетаданных = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				ОбъектНазначенияСсылка = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ОбъектМетаданных);
				СтрокаНазначения = СправочникОбъект.Назначение.Найти(ОбъектНазначенияСсылка, "ОбъектНазначения");
				Если СтрокаНазначения = Неопределено Тогда
					СтрокаНазначения = СправочникОбъект.Назначение.Добавить();
					СтрокаНазначения.ОбъектНазначения = ОбъектНазначенияСсылка;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект, , Истина);
	КонецЦикла;
КонецПроцедуры

// Преобразует строковое представление версии в числовое.
//
Функция ВерсияЧислом(ВерсияСтрокой)
	Если ПустаяСтрока(ВерсияСтрокой) Или ВерсияСтрокой = "0.0.0.0" Тогда
		Возврат 0;
	КонецЕсли;
	
	Разряд = 0;
	
	Результат = 0;
	
	Остаток = ВерсияСтрокой;
	ПозицияТочки = СтрНайти(Остаток, ".");
	Пока ПозицияТочки > 0 Цикл
		ЧислоСтрокой = Лев(Остаток, ПозицияТочки - 1);
		Число = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ЧислоСтрокой);
		Если Число = Неопределено Тогда
			Возврат 0;
		КонецЕсли;
		Результат = Результат * 1000 + Число;
		Остаток = Сред(Остаток, ПозицияТочки + 1);
		ПозицияТочки = СтрНайти(Остаток, ".");
		Разряд = Разряд + 1;
	КонецЦикла;
	
	Число = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Остаток);
	Если Число = Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	Результат = Результат * 1000 + Число;
	Разряд = Разряд + 1;
	
	// Номера версии после 4 точки возвращает после запятой.
	// Например, для версии "1.2.3.4.5.6.7" вернет 1002003004,005006007.
	Если Разряд > 4 Тогда
		Результат = Результат / Pow(1000, Разряд - 4);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Обновляет значения реквизитов предопределенных видов контактной информации.
Процедура ОбновитьПредопределенныеВидыКонтактнойИнформации() Экспорт
	
	// Справочник "Партнеры"
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации._ДемоАдресПартнера;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.Порядок = 1;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Телефон);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации._ДемоТелефонПартнера;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.Порядок = 2;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации._ДемоEmailПартнера;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	ПараметрыВида.Порядок = 3;
	ПараметрыВида.НастройкиПроверки.ПроверятьКорректность = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	// Справочник "Физические лица".
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации._ДемоEmailФизическогоЛица;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	ПараметрыВида.Порядок = 1;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	// Справочник "Контактные лица партнеров".
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации._ДемоАдресКонтактногоЛица;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.Порядок = 1;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации._ДемоEmailКонтактногоЛица;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	ПараметрыВида.Порядок = 2;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	// Справочник "Контрагенты"
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации._ДемоАдресКонтрагента;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.Порядок = 1;
	ПараметрыВида.НастройкиПроверки.АдресТолькоРоссийский = Истина;
	ПараметрыВида.НастройкиПроверки.ПроверятьКорректность = Истина;
	ПараметрыВида.НастройкиПроверки.ПроверятьПоФИАС = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации._ДемоEmailКонтрагента;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	ПараметрыВида.Порядок = 2;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	// Документ Заказ покупателя"
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации._ДемоПартнерыИКонтактныеЛицаАдресПартнера;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.Порядок = 1;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Телефон);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации._ДемоПартнерыИКонтактныеЛицаТелефонПартнера;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.Порядок = 2;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации._ДемоПартнерыИКонтактныеЛицаEmailПартнера;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.Порядок = 3;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
КонецПроцедуры

// Вызывается при переходе на версию конфигурации 2.2.4.33.
Процедура ОбновитьПредопределенныеВидыКонтактнойИнформацииФизическихЛиц() Экспорт
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации._ДемоEmailФизическогоЛица;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	ПараметрыВида.Порядок = 1;
	
КонецПроцедуры

// Вызывается при переходе на версию конфигурации 2.2.5.8.
Процедура ОбновитьПредопределенныеВидыКонтактнойИнформацииКонтрагентов() Экспорт
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации._ДемоАдресКонтрагента;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.ЗапретитьРедактированиеПользователем = Истина;
	ПараметрыВида.Порядок = 1;
	ПараметрыВида.НастройкиПроверки.АдресТолькоРоссийский = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации._ДемоEmailКонтрагента;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	ПараметрыВида.ЗапретитьРедактированиеПользователем = Истина;
	ПараметрыВида.Порядок = 2;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
КонецПроцедуры

// Заполнить значение констант ИспользоватьНесколькоОрганизаций и _ДемоОсновнаяОрганизация.
// 
Процедура ЗаполнитьКонстантыДляОрганизаций() Экспорт
	
	Константы._ДемоИспользоватьНесколькоОрганизаций.Установить(Справочники._ДемоОрганизации.КоличествоОрганизаций() > 1);
	Константы._ДемоОсновнаяОрганизация.Установить(Справочники._ДемоОрганизации.ОрганизацияПоУмолчанию());
	
КонецПроцедуры

// Обновляет значения реквизитов предопределенных ключевых операций.
Процедура ОбновитьПредопределенныеКлючевыеОперации() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КлючевыеОперации.Ссылка,
	               |	КлючевыеОперации.ИмяПредопределенныхДанных
	               |ИЗ
	               |	Справочник.КлючевыеОперации КАК КлючевыеОперации
	               |ГДЕ
	               |	КлючевыеОперации.Имя = """"
	               |	И КлючевыеОперации.Предопределенный";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		КлючеваяОперация = Выборка.Ссылка.ПолучитьОбъект();
		КлючеваяОперация.Имя = Выборка.ИмяПредопределенныхДанных;
		КлючеваяОперация.Записать();
	КонецЦикла;
	
КонецПроцедуры

// Заполнить реквизит ГруппаДоступа у справочников содержащих группы значений доступа,
// в данном случае у справочников _ДемоГруппыДоступаНоменклатуры, _ДемоГруппыДоступаПартнеров,
// чтобы использовать ограничение доступа этих справочников.
Процедура ЗаполнитьРеквизитГруппаДоступаУСправочниковГруппЗначенийДоступа() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	_ДемоГруппыДоступаНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник._ДемоГруппыДоступаНоменклатуры КАК _ДемоГруппыДоступаНоменклатуры
	|ГДЕ
	|	_ДемоГруппыДоступаНоменклатуры.ГруппаДоступа <> _ДемоГруппыДоступаНоменклатуры.Ссылка
	|	И НЕ _ДемоГруппыДоступаНоменклатуры.ЭтоГруппа
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	_ДемоГруппыДоступаПартнеров.Ссылка
	|ИЗ
	|	Справочник._ДемоГруппыДоступаПартнеров КАК _ДемоГруппыДоступаПартнеров
	|ГДЕ
	|	_ДемоГруппыДоступаПартнеров.ГруппаДоступа <> _ДемоГруппыДоступаПартнеров.Ссылка
	|	И НЕ _ДемоГруппыДоступаПартнеров.ЭтоГруппа";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Объект.ГруппаДоступа = Объект.Ссылка;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(Объект);
	КонецЦикла;
	
КонецПроцедуры

// Примеры обработчиков отложенного обновления.

// Проверяет, что обработчик отложенного обновления обработал документ _ДемоЗаказПокупателя.
//
// Параметры:
//  Параметры - Структура - см. ОбновлениеИнформационнойБазы.МетаданныеИОтборПоДанным.
//
Функция ЗаполненыДанныеДляСпискаЗаказПокупателя(Параметры) Экспорт
	
	Если ТипЗнч(Параметры.Данные) = Тип("ДокументСсылка._ДемоЗаказПокупателя") Тогда
		ДанныеАдреса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.Данные, "АдресДоставки,АдресДоставкиСтрокой,ЭлектроннаяПочта,ЭлектроннаяПочтаСтрокой");
	Иначе
		ДанныеАдреса = Параметры.Данные;
	КонецЕсли;
	
	АдресОбработан = (Не ПустаяСтрока(ДанныеАдреса.АдресДоставки) И Не ПустаяСтрока(ДанныеАдреса.АдресДоставкиСтрокой))
		Или (ПустаяСтрока(ДанныеАдреса.АдресДоставки) И ПустаяСтрока(ДанныеАдреса.АдресДоставкиСтрокой));
		
	ЭлектроннаяПочтаОбработана = (Не ПустаяСтрока(ДанныеАдреса.ЭлектроннаяПочта) И Не ПустаяСтрока(ДанныеАдреса.ЭлектроннаяПочтаСтрокой))
		Или (ПустаяСтрока(ДанныеАдреса.ЭлектроннаяПочта) И ПустаяСтрока(ДанныеАдреса.ЭлектроннаяПочтаСтрокой));
		
	Возврат АдресОбработан И ЭлектроннаяПочтаОбработана;
	
КонецФункции

// Заполняет корректными данными измерения последовательности документов движения товаров.
//
Процедура ЗаполнитьПоследовательностьДвиженияТоваров(Параметры) Экспорт 
	
	Запрос = Новый Запрос(" 
		|// Размер порции рассчитывается по документам. В порции будет обработано 5*4 = 20 документов максимум. 
		|// Каждый документ может относится к нескольким записям, поэтому количество записей порции может быть разным.
		|
		|ВЫБРАТЬ
		|	ПорцияОбработки.Ссылка               КАК Ссылка,
		|	ПорцияОбработки.Ссылка.Дата          КАК Период,
		|	ПорцияОбработки.Ссылка.МоментВремени КАК МоментВремени,
		|	
		|	ПорцияОбработки.Номенклатура  КАК Номенклатура,
		|	ПорцияОбработки.МестоХранения КАК МестоХранения
		|ИЗ (
		|	
		|	// Некорректное по поступлениям
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		Поступление.Ссылка               КАК Ссылка,
		|		Поступление.Номенклатура         КАК Номенклатура,
		|		Поступление.Ссылка.МестоХранения КАК МестоХранения
		|	ИЗ
		|		Документ._ДемоПоступлениеТоваров.Товары КАК Поступление
		|	ГДЕ
		|		Поступление.Ссылка В (
		|			ВЫБРАТЬ ПЕРВЫЕ 5
		|				Заполняемое.Регистратор
		|			ИЗ
		|				Последовательность._ДемоДвижениеТоваров КАК Заполняемое
		|			ГДЕ
		|				Заполняемое.Регистратор ССЫЛКА Документ._ДемоПоступлениеТоваров
		|				И Заполняемое.Номенклатура = ЗНАЧЕНИЕ(Справочник._ДемоНоменклатура.ПустаяСсылка)
		|			
		|			ОБЪЕДИНИТЬ ВСЕ
		|			
		|			ВЫБРАТЬ ПЕРВЫЕ 5
		|				Заполняемое.Регистратор
		|			ИЗ
		|				Последовательность._ДемоДвижениеТоваров КАК Заполняемое
		|			ГДЕ
		|				Заполняемое.Регистратор ССЫЛКА Документ._ДемоПоступлениеТоваров
		|				И Заполняемое.МестоХранения = ЗНАЧЕНИЕ(Справочник._ДемоМестаХранения.ПустаяСсылка)
		|			
		|			ОБЪЕДИНИТЬ ВСЕ
		|			
		|			ВЫБРАТЬ ПЕРВЫЕ 5
		|				Поступление.Ссылка
		|			ИЗ
		|				Документ._ДемоПоступлениеТоваров.Товары КАК Поступление
		|			ЛЕВОЕ СОЕДИНЕНИЕ
		|				Последовательность._ДемоДвижениеТоваров КАК Заполняемое
		|			ПО
		|				ВЫРАЗИТЬ(Заполняемое.Регистратор КАК Документ._ДемоПоступлениеТоваров) = Поступление.Ссылка
		|			ГДЕ
		|				Заполняемое.Регистратор ЕСТЬ NULL
		|		)
		|		И Поступление.Номенклатура <> ЗНАЧЕНИЕ(Справочник._ДемоНоменклатура.ПустаяСсылка)
		|		И Поступление.Ссылка.МестоХранения <> ЗНАЧЕНИЕ(Справочник._ДемоМестаХранения.ПустаяСсылка)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	// Некорректное по реализации
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		Реализация.Ссылка               КАК Ссылка,
		|		Реализация.Номенклатура         КАК Номенклатура,
		|		Реализация.Ссылка.МестоХранения КАК МестоХранения
		|	ИЗ
		|		Документ._ДемоРеализацияТоваров.Товары КАК Реализация
		|	ГДЕ
		|		Реализация.Ссылка В (
		|			ВЫБРАТЬ ПЕРВЫЕ 5
		|				Заполняемое.Регистратор
		|			ИЗ
		|				Последовательность._ДемоДвижениеТоваров КАК Заполняемое
		|			ГДЕ
		|				Заполняемое.Регистратор ССЫЛКА Документ._ДемоРеализацияТоваров
		|				И Заполняемое.Номенклатура = ЗНАЧЕНИЕ(Справочник._ДемоНоменклатура.ПустаяСсылка)
		|			
		|			ОБЪЕДИНИТЬ ВСЕ
		|			
		|			ВЫБРАТЬ ПЕРВЫЕ 5
		|				Заполняемое.Регистратор
		|			ИЗ
		|				Последовательность._ДемоДвижениеТоваров КАК Заполняемое
		|			ГДЕ
		|				Заполняемое.Регистратор ССЫЛКА Документ._ДемоРеализацияТоваров
		|				И Заполняемое.МестоХранения = ЗНАЧЕНИЕ(Справочник._ДемоМестаХранения.ПустаяСсылка)
		|			
		|			ОБЪЕДИНИТЬ ВСЕ
		|			
		|			ВЫБРАТЬ ПЕРВЫЕ 5
		|				Реализация.Ссылка
		|			ИЗ
		|				Документ._ДемоРеализацияТоваров.Товары КАК Реализация
		|			ЛЕВОЕ СОЕДИНЕНИЕ
		|				Последовательность._ДемоДвижениеТоваров КАК Заполняемое
		|			ПО
		|				ВЫРАЗИТЬ(Заполняемое.Регистратор КАК Документ._ДемоРеализацияТоваров) = Реализация.Ссылка
		|			ГДЕ
		|				Заполняемое.Регистратор ЕСТЬ NULL
		|		)
		|		И Реализация.Номенклатура <> ЗНАЧЕНИЕ(Справочник._ДемоНоменклатура.ПустаяСсылка)
		|		И Реализация.Ссылка.МестоХранения <> ЗНАЧЕНИЕ(Справочник._ДемоМестаХранения.ПустаяСсылка)
		|		
		|) КАК ПорцияОбработки
		|
		|ИТОГИ ПО
		|	Ссылка
		|");
		
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена = Ложь;
	
	КоличествоОшибок = 0;
	Обработано       = 0;
	
	// Обходим верхний уровень выборки - документ-источник.
	Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДокументовПорции = Выборка.Количество();
	
	Пока Выборка.Следующий() Цикл
		ТекущийДокумент = Выборка.Ссылка;
		ВыборкаНабора   = Выборка.Выбрать();
		Попытка
			ЗаполнитьЗаписиДвиженияТоваровДокумента(ТекущийДокумент, ВыборкаНабора);
			Обработано = Обработано + 1;
		Исключение
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось заполнить последовательность движений товаров для документа %1 по причине %2'"), 
					ТекущийДокумент, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
				ТекущийДокумент.Метаданные(), ТекущийДокумент, ТекстСообщения);
				
			КоличествоОшибок = КоличествоОшибок + 1;
		КонецПопытки;
	КонецЦикла;
	
	Если Обработано = 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Процедуре ""ЗаполнитьПоследовательностьДвиженияТоваров"" не удалось обработать некоторые документы (пропущены): %1'"), 
				КоличествоОшибок);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Процедура ""ЗаполнитьПоследовательностьДвиженияТоваров"" обработала очередную порцию документов: %1'"),
		ДокументовПорции);
		
	ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Информация, , , ТекстСообщения);
КонецПроцедуры

// Заполняет данными записи последовательности документов движения товаров.
//
Процедура ЗаполнитьЗаписиДвиженияТоваровДокумента(Знач Ссылка, Знач ВыборкаНабора)
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить( Ссылка.Метаданные().ПолноеИмя() );
	ЭлементБлокировки.УстановитьЗначение("Ссылка", Ссылка);
	
	ЭлементБлокировки = Блокировка.Добавить("Последовательность._ДемоДвижениеТоваров.НаборЗаписей");
	ЭлементБлокировки.УстановитьЗначение("Регистратор", Ссылка);
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		
		ДокументОбъект = Ссылка.ПолучитьОбъект();
		Если ДокументОбъект <> Неопределено Тогда
			// Документ не удален
			
			Набор = Последовательности._ДемоДвижениеТоваров.СоздатьНаборЗаписей();
			Набор.Отбор.Регистратор.Установить(Ссылка);
			Пока ВыборкаНабора.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(Набор.Добавить(), ВыборкаНабора);
			КонецЦикла;
			Набор.Записать(Истина);
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
		
КонецПроцедуры

// Пример перехода с конфигурации с именем "БиблиотекаСтандартныхПодсистемДемоБазовая".
// 
Процедура ПерейтиСБазовойВерсииНаПРОФ() Экспорт
	
	ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Информация,,,
		НСтр("ru = 'Выполнен обработчик перехода ПерейтиСБазовойВерсииНаПРОФ'", Метаданные.ОсновнойЯзык.КодЯзыка));
	
КонецПроцедуры

// Вызывается при переходе на версию конфигурации 2.3.1.5.
Процедура ОбновитьПредопределенныйВидКонтактнойИнформации() Экспорт
	
	// Добавление нового предопределенного вида контактной информации Skype.
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Skype);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации._ДемоSkypeКонтрагенты;
	ПараметрыВида.Порядок = 3;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Ложь;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	// Установка параметров вида контактной информации телефон организации.
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Телефон");
	ПараметрыВида.Вид = "_ДемоТелефонОрганизации";
	ПараметрыВида.НастройкиПроверки.ТелефонCДобавочнымНомером = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
КонецПроцедуры

// [2.3.1.10] Сбрасывает пользовательские настройки отчетов.
Процедура СброситьНастройкиОтчетов() Экспорт
	
	ВариантыОтчетов.СброситьПользовательскиеНастройки(Метаданные.Отчеты._ДемоДинамикаИзмененийФайлов);
	
КонецПроцедуры

// Выполняется на версию 2.3.1.19. Актуализирует признак использования
// видов контактной информации справочника КонтактныхЛицПартнеров.
//
Процедура ОбновитьИспользованиеКонтактнойИнформацииКонтактныхЛицПартнеров() Экспорт
	
	// Начальная инициализация новой константы.
	Константы._ДемоИспользоватьКонтактныеЛицаПартнеров.Установить(Истина);
	
	КонтактныеЛицПартнеров = Справочники.ВидыКонтактнойИнформации.Справочник_ДемоКонтактныеЛицаПартнеров.ПолучитьОбъект();
	КонтактныеЛицПартнеров.Используется = ПолучитьФункциональнуюОпцию("_ДемоИспользоватьКонтактныеЛицаПартнеров");
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(КонтактныеЛицПартнеров);
	
КонецПроцедуры

// Выполняется на версию 2.3.1.21. Актуализирует признак использования
// наборов свойств справочника Внешние пользователи.
//
Процедура ОбновитьИспользованиеНаборовСвойствВнешнихПользователей() Экспорт
	
	ПараметрыНабора = УправлениеСвойствами.СтруктураПараметровНабораСвойств();
	ПараметрыНабора.Используется = ПолучитьФункциональнуюОпцию("ИспользоватьВнешнихПользователей");
	УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Справочник_ВнешниеПользователи", ПараметрыНабора);
	
КонецПроцедуры

// Обновляет нумерацию видов контактной информации контрагентов.
Процедура ОбновитьПорядокВидовКонтактнойИнформацииКонтрагентов() Экспорт
	
	ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации._ДемоАдресКонтрагента.ПолучитьОбъект();
	ВидКонтактнойИнформации.РеквизитДопУпорядочивания = 1;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВидКонтактнойИнформации);
	
	ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации._ДемоEmailКонтрагента.ПолучитьОбъект();
	ВидКонтактнойИнформации.РеквизитДопУпорядочивания = 2;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВидКонтактнойИнформации);
	
	ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации._ДемоSkypeКонтрагенты.ПолучитьОбъект();
	ВидКонтактнойИнформации.РеквизитДопУпорядочивания = 3;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВидКонтактнойИнформации);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВидыКонтактнойИнформации.Ссылка
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|ГДЕ
	|	НЕ ВидыКонтактнойИнформации.Предопределенный
	|	И ВидыКонтактнойИнформации.Родитель = &Родитель";
	
	Запрос.УстановитьПараметр("Родитель", Справочники.ВидыКонтактнойИнформации.Справочник_ДемоКонтрагенты);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ВидКонтактнойИнформации = Выборка.Ссылка.ПолучитьОбъект();
		ВидКонтактнойИнформации.РеквизитДопУпорядочивания = 0;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВидКонтактнойИнформации,, Истина);
		
	КонецЦикла;
	
КонецПроцедуры

// Обновляет нумерацию видов контактной информации контрагентов.
Процедура УстановитьНазначенияРолейИсполнителей() Экспорт
	
	ЭлементСправочника = Справочники.РолиИсполнителей.Выбрать();
	Пока ЭлементСправочника.Следующий() Цикл
		Если ЭлементСправочника.Назначение.Количество() = 0 Тогда
			РольОбъект = ЭлементСправочника.ПолучитьОбъект();
			РольОбъект.Назначение.Добавить().ТипПользователей = Справочники.Пользователи.ПустаяСсылка();
			Если  ЭлементСправочника.Ссылка = Справочники.РолиИсполнителей._ДемоРуководительКомпании Тогда
				РольОбъект.Назначение.Добавить().ТипПользователей = Справочники._ДемоПартнеры.ПустаяСсылка();
				РольОбъект.Назначение.Добавить().ТипПользователей = Справочники._ДемоКонтактныеЛицаПартнеров.ПустаяСсылка();
			КонецЕсли;
			РольОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Заполняет поле ВидДляСписка у табличных частей контактной информации.
Процедура ЗаполнитьКонтактнуюИнформациюДляСписков(Параметры) Экспорт
	
	УправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформациюДляСписковОтложенно(Параметры);
	
КонецПроцедуры

Процедура ОбновитьНаборыЗначенийДоступаЗаданийСРолевойАдресацией(Параметры) Экспорт
	
	БизнесПроцесс = Метаданные.БизнесПроцессы._ДемоЗаданиеСРолевойАдресацией;
	ИмяПроцедуры = "МСОбновлениеИнформационнойБазы.ОбновитьНаборыЗначенийДоступаЗаданийСРолевойАдресацией";
	
	БизнесПроцессыИЗадачиСервер.НачатьОбновлениеПорцииНаборовЗначенийДоступа(Параметры, БизнесПроцесс, ИмяПроцедуры, 1000);
	Если Параметры.ОбработкаЗавершена Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЗаданиеСсылка Из Параметры.ОбъектыКОбработке Цикл
		
		Попытка
			ОбновитьНаборыЗначенийДоступаЗадания(ЗаданиеСсылка);
			Параметры.ОбъектовОбработано = Параметры.ОбъектовОбработано + 1;
		Исключение
			// Если не удалось обработать какой-либо объект, в следующий раз повторим попытку снова.
			Параметры.ПроблемныеОбъекты.Добавить(ЗаданиеСсылка);
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось обновить права доступа для ""%1"" в обработчике ""%2"" по причине:
					|%3'"), 
					ЗаданиеСсылка, ИмяПроцедуры, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
				БизнесПроцесс, ЗаданиеСсылка, ТекстСообщения);
		КонецПопытки;
		
	КонецЦикла;
	
	БизнесПроцессыИЗадачиСервер.ЗавершитьОбновлениеПорцииНаборовЗначенийДоступа(Параметры);
	
КонецПроцедуры

Процедура ОбновитьКонтактнуюИнформациюЗаказовПокупателя(Параметры) Экспорт
	
	// Расчет общего количества обрабатываемых объектов.
	Если Параметры.ПрогрессВыполнения.ВсегоОбъектов = 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Количество(_ДемоЗаказПокупателя.Ссылка) КАК Количество
		|ИЗ
		|	Документ._ДемоЗаказПокупателя КАК _ДемоЗаказПокупателя
		|ГДЕ
		|	((ВЫРАЗИТЬ(_ДемоЗаказПокупателя.АдресДоставки КАК СТРОКА(100))) <> """"
		|				И _ДемоЗаказПокупателя.АдресДоставкиСтрокой = """"
		|			ИЛИ (ВЫРАЗИТЬ(_ДемоЗаказПокупателя.ЭлектроннаяПочта КАК СТРОКА(100))) <> """"
		|				И _ДемоЗаказПокупателя.ЭлектроннаяПочтаСтрокой = """")";
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		Параметры.ПрогрессВыполнения.ВсегоОбъектов = РезультатЗапроса[0].Количество;
	КонецЕсли;
	
	// Выбрать все заказы покупателя с неинициализированным значением нового реквизита.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 50
	|	_ДемоЗаказПокупателя.Ссылка КАК Ссылка
	|ИЗ
	|	Документ._ДемоЗаказПокупателя КАК _ДемоЗаказПокупателя
	|ГДЕ
	|	((ВЫРАЗИТЬ(_ДемоЗаказПокупателя.АдресДоставки КАК СТРОКА(100))) <> """"
	|				И _ДемоЗаказПокупателя.АдресДоставкиСтрокой = """"
	|			ИЛИ (ВЫРАЗИТЬ(_ДемоЗаказПокупателя.ЭлектроннаяПочта КАК СТРОКА(100))) <> """"
	|				И _ДемоЗаказПокупателя.ЭлектроннаяПочтаСтрокой = """")
	|
	|УПОРЯДОЧИТЬ ПО
	|	_ДемоЗаказПокупателя.Дата УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Если РезультатЗапроса.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Параметры.ОбработкаЗавершена = Ложь;
	
	ПроблемныхОбъектов = 0;
	ОбъектовОбработано = 0;
	
	Для Каждого ЗаказПокупателя Из РезультатЗапроса Цикл
		
		Попытка
			ДокументОбъект = ЗаказПокупателя.Ссылка.ПолучитьОбъект();
			ДокументОбъект.АдресДоставкиСтрокой = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформации(ДокументОбъект.АдресДоставки);
			ДокументОбъект.ЭлектроннаяПочтаСтрокой = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформации(ДокументОбъект.ЭлектроннаяПочта);
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
			ОбъектовОбработано = ОбъектовОбработано + 1;
		Исключение
			// Если не удалось обработать какой-либо заказ, повторяем попытку снова.
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось обработать заказ покупателя: %1 по причине:
					|%2'"), 
					ЗаказПокупателя.Ссылка, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
				Метаданные.Документы._ДемоЗаказПокупателя, ЗаказПокупателя.Ссылка, ТекстСообщения);
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ПрогрессВыполнения.ОбработаноОбъектов = Параметры.ПрогрессВыполнения.ОбработаноОбъектов + ОбъектовОбработано;
	Если ОбъектовОбработано = 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Процедуре ОбновитьКонтактнуюИнформациюЗаказовПокупателя не удалось обработать некоторые заказы покупателей (пропущены): %1'"), 
				ПроблемныхОбъектов);
		ВызватьИсключение ТекстСообщения;
	Иначе
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Информация,
			Метаданные.Документы._ДемоЗаказПокупателя,,
				НСтр("ru = 'Процедура ОбновитьКонтактнуюИнформациюЗаказовПокупателя обработала очередную порцию заказов покупателей: 50'"));
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьНаборыЗначенийДоступаЗадания(ЗаданиеСсылка) 
	
	НачатьТранзакцию();
	Попытка
	
		// Блокируем объект от изменения другими сеансами.
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("БизнесПроцесс._ДемоЗаданиеСРолевойАдресацией");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", ЗаданиеСсылка);
		Блокировка.Заблокировать();
		
		ЗаданиеОбъект = ЗаданиеСсылка.ПолучитьОбъект();
		// Если объект ранее был удален или обработан другими сеансами, пропускаем его.
		Если ЗаданиеОбъект = Неопределено Тогда 
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;
		УправлениеДоступом.ОбновитьНаборыЗначенийДоступа(ЗаданиеОбъект);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
		
КонецПроцедуры

// Включает константу _ДемоОграничиватьДоступПоПартнерам, если RLS включен и
// внешние пользователи используются.
//
Процедура ВключитьОграничениеПоПартнерамПриИспользованииВнешнихПользователей() Экспорт
	
	Если Константы.ОграничиватьДоступНаУровнеЗаписей.Получить()
		И Константы.ИспользоватьВнешнихПользователей.Получить()
		И Не Константы._ДемоОграничиватьДоступПоПартнерам.Получить() Тогда
		
		Константы._ДемоОграничиватьДоступПоПартнерам.Установить(Истина);
	КонецЕсли;
	
КонецПроцедуры

// Выполняется для обновления видов контактной информации для версии БСП 2.3.2.4 и выше.
// Для юридического адреса организации устанавливает флаг ХранитьИсториюИзменений.
// Для сохранения обратной совместимости всех элементов с видом контактной информации Другое
// свойство МногострочноеПоле устанавливается в Истина.
//
Процедура НастроитьИсториюКонтактнойИнформацииИМногострочноеПоле() Экспорт
	
	ЮридическийАдресОрганизации = Справочники.ВидыКонтактнойИнформации._ДемоЮридическийАдресОрганизации.ПолучитьОбъект();
	ЮридическийАдресОрганизации.ХранитьИсториюИзменений = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЮридическийАдресОрганизации);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыКонтактнойИнформации.Ссылка
		|ИЗ
		|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
		|ГДЕ
		|	ВидыКонтактнойИнформации.Тип = &Тип";
	
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Другое);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		ВидКонтактнойИнформации = РезультатЗапроса.Ссылка.ПолучитьОбъект();
		ВидКонтактнойИнформации.УдалитьМногострочноеПоле = Истина;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВидКонтактнойИнформации);
	КонецЦикла;
	
КонецПроцедуры

// Выполняется для создания шаблонов сообщений для версии БСП 2.3.3.63 и выше.
//
Процедура ЗаполнитьШаблоныСообщений() Экспорт
	
	МетаданныеОбъекта = Метаданные.Документы._ДемоСчетНаОплатуПокупателю;
	ПараметрыШаблона = ШаблоныСообщений.ОписаниеПараметровШаблона();
	ПараметрыШаблона.ТипШаблона = "Письмо";
	ПараметрыШаблона.Тема = НСтр("ru = 'Оплата счета №[_ДемоСчетНаОплатуПокупателю.Номер] от [_ДемоСчетНаОплатуПокупателю.Дата]'");
	ПараметрыШаблона.Текст = НСтр("ru = '<p>Здравствуйте, [_ДемоСчетНаОплатуПокупателю.Партнер.Наименование]</p>
		|<br>
		|<p>Направляем счет №[_ДемоСчетНаОплатуПокупателю.Номер] от [_ДемоСчетНаОплатуПокупателю.Дата] на сумму 
		|[_ДемоСчетНаОплатуПокупателю.СуммаОплаты] руб. для оплаты согласно договору.</p>
		|<p>Просим произвести оплату не позднее [_ДемоСчетНаОплатуПокупателю.ДатаОплаты]</p>
		|<br>
		|<p>Спасибо, что выбрали нас!</p>
		|<br>
		|<p>[ОбщиеРеквизиты.ТекущийПользователь.Наименование] </p>
		|<p>[ОбщиеРеквизиты.ТекущаяДата]</p>'");
		
	ПараметрыШаблона.ПолноеИмяТипаНазначения = МетаданныеОбъекта.ПолноеИмя();
	ПараметрыШаблона.Назначение = МетаданныеОбъекта.Представление();
	ШаблоныСообщений.СоздатьШаблон(НСтр("ru = 'Уведомление о счете на оплату'"), ПараметрыШаблона);
	
КонецПроцедуры


#КонецОбласти