
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ЦентрМониторинга
	
	// Подсчитываем количество созданий формы, стандартный разделитель ".".
	Комментарий = Строка(ПолучитьСкоростьКлиентскогоСоединения());
	ЦентрМониторинга.ЗаписатьОперациюБизнесСтатистики(ЭтаФорма.ИмяФормы + ".ПриСозданииНаСервере", 1, Комментарий);
	
	// Конец СтандартныеПодсистемы.ЦентрМониторинга
	
	Если Параметры.Свойство("Заголовок") Тогда
		ЭтаФорма.АвтоЗаголовок = Ложь;
		ЭтаФорма.Заголовок = Параметры.Заголовок;
	КонецЕсли;
	
	Данные = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Данные", 
		ЧислаКлиентСервер.СтруктураЧисла());
		
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Данные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Перем Число;
	
	Число = ЧислаКлиентСервер.СтруктураЧисла();
	ЗаполнитьЗначенияСвойств(Число, ЭтаФорма);
	ЭтаФорма.Закрыть(Число);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПриИзменении(Элемент)
	
	Перем Число;
	
	Число = ЧислаКлиентСервер.СтруктураЧисла();
	ЗаполнитьЗначенияСвойств(Число, ЭтаФорма);
	
	ЭтаФорма.Представление = ЧислаКлиентСервер.ПолучитьПредставлениеЧисла(Число);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
