
#Область ПрограммныйИнтерфейс

#Область СтепениИИндексы

// Преобразует переданный показатель степени (число) в Unicode строку (верхний индекс).
//
// Параметры:
//  ПоказательСтепени	 - Строка, Число	 - Показатель степени
// 
// Возвращаемое значение:
//   Строка - показатель степени как Unicode строка (символами из блока верхнего индекса)
//
Функция ПолучитьСтрокуИзПоказателяСтепени(Знач ПоказательСтепени) Экспорт
	Результат = "";
	Соответствие = РаботаСоСтрокамиЮникодСерверПовтИсп.ПолучитьСоответствиеНадстрочныхИндексов();
	Для НомерСимвола = 1 По СтрДлина(ПоказательСтепени) Цикл
		Результат = Результат + Соответствие.Получить(Сред(ПоказательСтепени, НомерСимвола, 1));
    КонецЦикла;
	Возврат Результат;
КонецФункции

// Преобразует переданный показатель степени (число) в Unicode строку (верхний индекс).
//  Для показателя степени "1" возвращает пустую строку.
//
// Параметры:
//  ПоказательСтепени	 - Строка, Число	 - Показатель степени
// 
// Возвращаемое значение:
//   Строка - показатель степени как Unicode строка (символами из блока верхнего индекса)
//
Функция ПолучитьСтрокуИзПоказателяСтепениКраткую(Знач ПоказательСтепени) Экспорт
	Если Строка(ПоказательСтепени) = "1" Тогда
		Возврат "";
	Иначе
		Возврат ПолучитьСтрокуИзПоказателяСтепени(ПоказательСтепени);
	КонецЕсли;
КонецФункции

#КонецОбласти

#КонецОбласти