
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Получение обновлений программы".
// ОбщийМодуль.ПолучениеОбновленийПрограммыКлиентПереопределяемый.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определяет необходимость показа всплывающего оповещения о
// доступном обновлении программы. Вызывается только при наличии
// встроенной подсистемы СтандартныеПодсистемы.ТекущиеДела.
//
// Использование - Булево - в параметре возвращается признак необходимости
//	показа оповещения. Истина- показать, Ложь - в противном случае.
//
Процедура ПриОпределенииНеобходимостиПоказаОповещенийОДоступныхОбновлениях(Использование) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти
