#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Основание = 0 Тогда
		Основание = 10;
	КонецЕсли;
	
	Код = ПолучитьКод();
	
КонецПроцедуры

Функция ПолучитьКод()
	Возврат Справочники.МСЕдиницыВеличинПриставкиКратныхИДольных.ПолучитьКод(Порядок, Основание);
КонецФункции

Процедура ОбработкаЗаполнения(Знач ДанныеЗаполнения, Знач ТекстЗаполнения, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецЕсли