#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает приставку в зависимости от функциональных опций.
//
// Возвращаемое значение:
//   Строка - приставка
//
Функция ПолучитьПриставку() Экспорт
	Возврат ЭтотОбъект[ПолучитьРеквизитПриставки()];
КонецФункции

// Возвращает обозначение приставки в зависимости от функциональных опций.
//
// Возвращаемое значение:
//   Строка - обозначение приставки
//
Функция ПолучитьОбозначение() Экспорт
	Возврат ЭтотОбъект[ПолучитьРеквизитОбозначения()];
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Основание = 0 Тогда
		Основание = 10;
	КонецЕсли;
	
	Код = ПолучитьКод();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Знач ДанныеЗаполнения, Знач ТекстЗаполнения, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьКод()
	Возврат Справочники.МСЕдиницыВеличинПриставкиКратныхИДольных.ПолучитьКод(Порядок, Основание);
КонецФункции

Функция ПолучитьРеквизитПриставки()
	Возврат Справочники.МСЕдиницыВеличинПриставкиКратныхИДольных.ПолучитьРеквизитПриставки();
КонецФункции

Функция ПолучитьРеквизитОбозначения()
	Возврат Справочники.МСЕдиницыВеличинПриставкиКратныхИДольных.ПолучитьРеквизитОбозначения();
КонецФункции

#КонецОбласти


#КонецЕсли