////////////////////////////////////////////////////////////////////////////////
// Подсистема "Метрологическая служба. Единицы величин".
// ОбщийМодуль.МСЕдиницыВеличинКлиентСерверПовтИсп.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает наименование реквизита, содержащего наименование в зависимости от функциональных опций.
//
// Возвращаемое значение:
//   Строка - наименование реквизита
//
Функция ПолучитьРеквизитНаименования() Экспорт

	Перем Обозначения;
	Обозначения = ПолучитьФункциональнуюОпцию("МСЕдиницыВеличинОбозначения");

	Возврат "Наименование" + Обозначения.Метаданные().ЗначенияПеречисления[Перечисления[Обозначения.Метаданные().Имя].Индекс(Обозначения)].Имя;

КонецФункции

// Возвращает наименование реквизита, содержащего обозначение в зависимости от функциональных опций.
//
// Возвращаемое значение:
//   Строка - наименование реквизита
//
Функция ПолучитьРеквизитОбозначения() Экспорт

	Перем Обозначения;
	Обозначения = ПолучитьФункциональнуюОпцию("МСЕдиницыВеличинОбозначения");

	Возврат "Обозначение" + Обозначения.Метаданные().ЗначенияПеречисления[Перечисления[Обозначения.Метаданные().Имя].Индекс(Обозначения)].Имя;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
