////////////////////////////////////////////////////////////////////////////////
// Подсистема "Метрологическая служба. Единицы величин".
// ОбщийМодуль.МСЕдиницыВеличинКлиентСерверПовтИсп.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает наименование реквизита, содержащего наименование в зависимости от функциональных опций.
//
// Возвращаемое значение:
//   Строка - наименование реквизита
//
Функция ПолучитьРеквизитНаименования() Экспорт

	Возврат "Наименование"
		+ ОбщегоНазначения.ИмяЗначенияПеречисления(ПолучитьФункциональнуюОпцию("МСЕдиницыВеличинОбозначения"))
	;

КонецФункции

// Возвращает наименование реквизита, содержащего наименование в зависимости от функциональных опций.
//
// Возвращаемое значение:
//   Строка - наименование реквизита
//
Функция ПолучитьРеквизитНаименованияПриставки() Экспорт

	Возврат "Наименование" 
		+ ОбщегоНазначения.ИмяЗначенияПеречисления(ПолучитьФункциональнуюОпцию("МСЕдиницыВеличинОбозначения"))
		+ ?( ПолучитьФункциональнуюОпцию("МСЕдиницыВеличинОбозначенияПриставок") = Перечисления.МСЕдиницыВеличинОбозначенияПриставок.ПоПостановлениюПравительстваРФ879,
			"",
			"ISO_80000_1"
		)
	;

КонецФункции

// Возвращает наименование реквизита, содержащего обозначение в зависимости от функциональных опций.
//
// Возвращаемое значение:
//   Строка - наименование реквизита
//
Функция ПолучитьРеквизитОбозначения() Экспорт

	Возврат "Обозначение"
		+ ОбщегоНазначения.ИмяЗначенияПеречисления(ПолучитьФункциональнуюОпцию("МСЕдиницыВеличинОбозначения"))
	;

КонецФункции

// Возвращает наименование реквизита, содержащего обозначение в зависимости от функциональных опций.
//
// Возвращаемое значение:
//   Строка - наименование реквизита
//
Функция ПолучитьРеквизитОбозначенияПриставки() Экспорт

	Возврат "Обозначение"
		+ ОбщегоНазначения.ИмяЗначенияПеречисления(ПолучитьФункциональнуюОпцию("МСЕдиницыВеличинОбозначения"))
		+ ?( ПолучитьФункциональнуюОпцию("МСЕдиницыВеличинОбозначенияПриставок") = Перечисления.МСЕдиницыВеличинОбозначенияПриставок.ПоПостановлениюПравительстваРФ879,
			"",
			"ISO_80000_1"
		)
	;

КонецФункции

// Возвращает описание типов свойств наименований и обозначений единиц величин для последующего использования
// в ОбщегоНазначенияКлиентСервер.ПроверитьПараметр.
//
// Возвращаемое значение:
//   Структура - типы свойств наименований и обозначений
//
Функция ПолучитьТипыСвойствНаименованияИОбозначения() Экспорт

	Перем ОжидаемыеТипыСвойств;
	
	ОжидаемыеТипыСвойств = Новый Структура();
	
	Для Каждого ВариантОбозначения Из Метаданные.Перечисления.МСЕдиницыВеличинОбозначения.ЗначенияПеречисления Цикл
		Если ПолучитьФункциональнуюОпцию("МСЕдиницыВеличинИспользоватьОбозначения" + ВариантОбозначения.Имя) Тогда
			ОжидаемыеТипыСвойств.Вставить("Наименование" + ВариантОбозначения.Имя, Тип("Строка"));
			ОжидаемыеТипыСвойств.Вставить("Обозначение" + ВариантОбозначения.Имя, Тип("Строка"));
		КонецЕсли;
	КонецЦикла;
	
	
	Возврат ОжидаемыеТипыСвойств;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
