////////////////////////////////////////////////////////////////////////////////
// Подсистема "Метрологическая служба. Единицы величин".
// ОбщийМодуль.МСЕдиницыВеличинКлиентСерверПовтИсп.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает наименование реквизита, содержащего наименование в зависимости от функциональных опций.
//
// Возвращаемое значение:
//   Строка - наименование реквизита
//
Функция ПолучитьРеквизитНаименования() Экспорт

	Возврат "Наименование" + ОбщегоНазначения.ИмяЗначенияПеречисления(ПолучитьФункциональнуюОпцию("МСЕдиницыВеличинОбозначения"));

КонецФункции

// Возвращает наименование реквизита, содержащего обозначение в зависимости от функциональных опций.
//
// Возвращаемое значение:
//   Строка - наименование реквизита
//
Функция ПолучитьРеквизитОбозначения() Экспорт

	Возврат "Обозначение" + ОбщегоНазначения.ИмяЗначенияПеречисления(ПолучитьФункциональнуюОпцию("МСЕдиницыВеличинОбозначения"));

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
