

#Область СтепениИИндексы

// Формирует соответствие надстрочных индексов строчным символам.
//
Функция ПолучитьСоответствиеНадстрочныхИндексов() Экспорт
	
	Результат = Новый Соответствие();
	
	Результат.Вставить("0","⁰");
	Результат.Вставить("1","¹");
	Результат.Вставить("2","²");
	Результат.Вставить("3","³");
	Результат.Вставить("4","⁴");
	Результат.Вставить("5","⁵");
	Результат.Вставить("6","⁶");
	Результат.Вставить("7","⁷");
	Результат.Вставить("8","⁸");
	Результат.Вставить("9","⁹");
	
	Результат.Вставить("-","⁻");
	Результат.Вставить("+","⁺");
	
	Возврат Результат;
	
КонецФункции

// Формирует соответствие постфиксов к наименованию степени
// по показателю степени.
//
Функция ПолучитьСоответствиеНаименованийСтепеней() Экспорт
	
	Результат = Новый Соответствие();
	
	Результат.Вставить(0,"");
	Результат.Вставить(1,"");
	Результат.Вставить(2,"в квадрате");
	Результат.Вставить(3,"в кубе");
	Результат.Вставить(4,"в четвёртой степени");
	Результат.Вставить(5,"в пятой степени");
	Результат.Вставить(6,"в шестой степени");
	Результат.Вставить(7,"в седьмой степени");
	Результат.Вставить(8,"в восьмой степени");
	Результат.Вставить(9,"в девятой степени");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти