
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОбработкаКомандыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаКомандыНаСервере()
	
	//Файл = новый Файл(ЭтотОбъект.ИспользуемоеИмяФайла);
	//Загрузка = ВнешниеОбработки.Создать(Файл.Путь+"lib\loadGrammar.epf");
	Загрузка = Обработки.loadGrammar.Создать();
	//Парсер = ВнешниеОбработки.Создать(Файл.Путь+"lib\parser.epf");
	Парсер = Обработки.parser.Создать();
	
	//Грамматика = Загрузка.ПрочитатьГрамматику(Файл.Путь+"tst\grammar-phone-number.xml");
	Грамматика = Загрузка.ПрочитатьГрамматикуИзТекста(Обработки.test.ПолучитьМакет("Грамматика").ПолучитьТекст());
	
	Данные = новый Структура;
	Данные.Вставить("Текст","(123) 321-1234");
	Данные.Вставить("Автомат",Грамматика);
	
	Результат = Парсер.РазобратьТекст(Данные);
	
	Возврат;
	
	//Ожидаем.Что(ТипЗнч(Результат)).Равно(Тип("Структура"));
	//Ожидаем.Что(Результат.lxmNum3.Data).Равно("321");
	//Ожидаем.Что(Результат.lxmNum4.Data).Равно("1234");
	//Ожидаем.Что(ТипЗнч(Результат.AreaCode)).Равно(Тип("Структура"));
	//Ожидаем.Что(Результат.AreaCode.lxmNum3.Data).Равно("123");
	
КонецПроцедуры
