
#Область ПрограммныйИнтерфейс

// Возвращает код языка для указанного языка.
//
// Параметры:
// 	Язык - ПеречислениеСсылка.Языки, Строка - Ссылка на значение перечисления Языки либо собственно код языка.
//
// Возвращаемое значение: Строка - Код языка
//
Функция ПолучитьКодЯзыка(Знач Язык) Экспорт
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		"Перечисления.Языки.ПолучитьКодЯзыка",
		"Язык",
		Язык,
		Новый ОписаниеТипов("Строка, ПеречислениеСсылка.Языки"));
	
	Если ТипЗнч(Язык) = Тип("Строка") Тогда
		Возврат Язык;
	ИначеЕсли ТипЗнч(Язык) = Тип("ПеречислениеСсылка.Языки") Тогда
		Возврат ОбщегоНазначения.ИмяЗначенияПеречисления(Язык);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

