////////////////////////////////////////////////////////////////////////////////
// Подсистема "Метрологическая служба. Единицы величин".
// ОбщийМодуль.МСЕдиницыВеличин.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Интеграция с Библиотекой стандартных подсистем (БСП).
// Подсистема "Базовая функциональность".

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает идентификатор подсистемы в в справочнике объектов
// метаданных.
//
Функция ИдентификаторПодсистемы() Экспорт
	
	Возврат ОбщегоНазначения.ИдентификаторОбъектаМетаданных(
		"Подсистема.МетрологическаяСлужба.Подсистема.ЕдиницыВеличин");
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы

// Заполняет список обработчиков обновления информационной базы.
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура =
		"МСЕдиницыВеличин.ОбновлениеИнформационнойБазы_НачальноеЗаполнение";
	Обработчик.ОбщиеДанные 		   = Истина;
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.РежимВыполнения     = "Монопольно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия    = "1.0.1.10";
	Обработчик.Процедура =
		"МСЕдиницыВеличин.ОбновлениеИнформационнойБазы_Заполнение_1_0_1_10";
	Обработчик.ОбщиеДанные 		   = Истина;
	Обработчик.РежимВыполнения     = "Монопольно";
	Обработчик.Комментарий =
		НСтр("ru = 'Проверка и восстановление единиц величин. Рекомендуется воздержаться от их редактирования до завершения обработки.'");

КонецПроцедуры

Процедура ОбновлениеИнформационнойБазы_НачальноеЗаполнение() Экспорт
	
	ОбновлениеИнформационнойБазы_Заполнение_1_0_1_10();

КонецПроцедуры

Процедура ОбновлениеИнформационнойБазы_Заполнение_1_0_1_10() Экспорт
	
	ОбновитьКод_1_0_1_10();
	
	Справочники.МСЕдиницыВеличинПриставкиКратныхИДольных.ЗаполнитьПредопределённый(10,  24, "иотта",   "И");
	Справочники.МСЕдиницыВеличинПриставкиКратныхИДольных.ЗаполнитьПредопределённый(10,  21, "зетта",   "З");
	Справочники.МСЕдиницыВеличинПриставкиКратныхИДольных.ЗаполнитьПредопределённый(10,  18, "экса",    "Э");
	Справочники.МСЕдиницыВеличинПриставкиКратныхИДольных.ЗаполнитьПредопределённый(10,  15, "пета",    "П");
	Справочники.МСЕдиницыВеличинПриставкиКратныхИДольных.ЗаполнитьПредопределённый(10,  12, "тера",    "Т");
	Справочники.МСЕдиницыВеличинПриставкиКратныхИДольных.ЗаполнитьПредопределённый(10,   9, "гига",    "Г");
	Справочники.МСЕдиницыВеличинПриставкиКратныхИДольных.ЗаполнитьПредопределённый(10,   6, "мега",    "М");
	Справочники.МСЕдиницыВеличинПриставкиКратныхИДольных.ЗаполнитьПредопределённый(10,   3, "кило",    "к");
	Справочники.МСЕдиницыВеличинПриставкиКратныхИДольных.ЗаполнитьПредопределённый(10,   2, "гекто",   "г");
	Справочники.МСЕдиницыВеличинПриставкиКратныхИДольных.ЗаполнитьПредопределённый(10,   1, "дека",    "да");
	Справочники.МСЕдиницыВеличинПриставкиКратныхИДольных.ЗаполнитьПредопределённый(10,  -1, "деци",    "д");
	Справочники.МСЕдиницыВеличинПриставкиКратныхИДольных.ЗаполнитьПредопределённый(10,  -2, "санти",   "с");
	Справочники.МСЕдиницыВеличинПриставкиКратныхИДольных.ЗаполнитьПредопределённый(10,  -3, "милли",   "м");
	Справочники.МСЕдиницыВеличинПриставкиКратныхИДольных.ЗаполнитьПредопределённый(10,  -6, "микро",   "мк");
	Справочники.МСЕдиницыВеличинПриставкиКратныхИДольных.ЗаполнитьПредопределённый(10,  -9, "нано",    "н");
	Справочники.МСЕдиницыВеличинПриставкиКратныхИДольных.ЗаполнитьПредопределённый(10, -12, "пико",    "п");
	Справочники.МСЕдиницыВеличинПриставкиКратныхИДольных.ЗаполнитьПредопределённый(10, -15, "фемто",   "ф");
	Справочники.МСЕдиницыВеличинПриставкиКратныхИДольных.ЗаполнитьПредопределённый(10, -18, "атто",    "а");
	Справочники.МСЕдиницыВеличинПриставкиКратныхИДольных.ЗаполнитьПредопределённый(10, -21, "зепто",   "з");
	Справочники.МСЕдиницыВеличинПриставкиКратныхИДольных.ЗаполнитьПредопределённый(10, -24, "иокто",   "и");

КонецПроцедуры

Процедура ОбновитьКод_1_0_1_10()
	
	Приставка = Справочники.МСЕдиницыВеличинПриставкиКратныхИДольных.Выбрать();
	Пока Приставка.Следующий() Цикл
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(Приставка.ПолучитьОбъект(), , Истина);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
