////////////////////////////////////////////////////////////////////////////////
// Подсистема "Стандартные подсистемы ИТГ. Структурированные реквизиты".
// ОбщийМодуль.СтруктурированныеРеквизитыПереопределяемый.
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определить объекты метаданных, в модулях менеджеров которых описываются реквизиты,
// хранящие структурированные значения,
// с помощью экспортной функции ПолучитьРеквизитыОбъектаСоСтруктурированнымиРеквизитами.
//
// Параметры:
//   Объекты - Соответствие - в качестве ключа указать полное имя объекта метаданных,
//                            подключенного к подсистеме "Структурированные реквизиты";
//                            В качестве значения - пустую строку.
//
// Пример: 
//   Объекты.Вставить(Метаданные.Документы.ЗаказПокупателя.ПолноеИмя(), "");
//
Процедура ПриОпределенииОбъектовСоСтруктурированнымиРеквизитами(Объекты) Экспорт
	
	МССтандартныеПодсистемы.ПриОпределенииОбъектовСоСтруктурированнымиРеквизитами(Объекты);
	
КонецПроцедуры

#КонецОбласти
