
&НаКлиенте
Процедура ПриОткрытииСтруктурированногоЗначения(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормыСтруктурированногоЗначения = ПодготовитьПараметрыФормыСтруктурированногоЗначения(Элемент.Имя);
	ОповещениеОЗакрытииФормыСтруктурированногоЗначения = Новый ОписаниеОповещения(
		"ПриОткрытииСтруктурированногоЗначенияЗавершение", ЭтотОбъект,
		Новый Структура("ИмяЭлемента", Элемент.Имя));
	ОткрытьФорму("ОбщаяФорма.ЧислоВЭкспоненциальнойЗаписи", ПараметрыФормыСтруктурированногоЗначения,
		ЭтаФорма, Строка(ЭтаФорма.УникальныйИдентификатор) + Элемент.Имя, , ,
		ОповещениеОЗакрытииФормыСтруктурированногоЗначения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
	
&НаСервере
Функция ПодготовитьПараметрыФормыСтруктурированногоЗначения(Знач ИмяЭлемента)
	
	Элемент = ЭтаФорма.Элементы[ИмяЭлемента];
	ЧастиПутиКДанным = СтрРазделить(Элемент.ПутьКДанным, ".");
	
	ПараметрыФормыСтруктурированногоЗначения = Новый Структура;
	
	ЗаголовокФормыСтруктурированногоЗначения = "";
	Если Не ПустаяСтрока(Элемент.Заголовок) Тогда
		ЗаголовокФормыСтруктурированногоЗначения = Элемент.Заголовок;
	Иначе
		РеквизитФормы = ЭтаФорма.ПолучитьРеквизиты(ЧастиПутиКДанным[0])[0];
		Если ЧастиПутиКДанным.Количество() = 1 Тогда
			ЗаголовокФормыСтруктурированногоЗначения = РеквизитФормы.Заголовок;
		Иначе
			МетаданныеРеквизита = Метаданные.НайтиПоТипу(РеквизитФормы.ТипЗначения.Типы()[0]); 
			Для ИндексЧастиПути = 1 по ЧастиПутиКДанным.ВГраница() Цикл 
				МетаданныеРеквизита = МетаданныеРеквизита.Реквизиты[ЧастиПутиКДанным[ИндексЧастиПути]];
			КонецЦикла;
			ЗаголовокФормыСтруктурированногоЗначения = МетаданныеРеквизита.Синоним;
		КонецЕсли;
	КонецЕсли;
	ПараметрыФормыСтруктурированногоЗначения.Вставить("Заголовок", ЗаголовокФормыСтруктурированногоЗначения);
	
	ТекущееЗначение = ЭтаФорма;
	Для Каждого ИмяРеквизита Из ЧастиПутиКДанным Цикл 
		ВладелецЗначения = ТекущееЗначение;
		ТекущееЗначение  = ТекущееЗначение[ИмяРеквизита];
	КонецЦикла;
	ПараметрыФормыСтруктурированногоЗначения.Вставить("Данные", ЭтаФорма[ИмяРеквизита + "Данные"]);
	
	Возврат ПараметрыФормыСтруктурированногоЗначения;
	
КонецФункции
	
&НаКлиенте
Процедура ПриОткрытииСтруктурированногоЗначенияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ИзменитьРеквизитФормыСоСтруктурированнымЗначением(ДополнительныеПараметры.ИмяЭлемента, Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьРеквизитФормыСоСтруктурированнымЗначением(Знач ИмяЭлемента, Знач Значение)
	
	Элемент = ЭтаФорма.Элементы[ИмяЭлемента];
	ЧастиПути = СтрРазделить(Элемент.ПутьКДанным, ".");
	ТекущееЗначение = ЭтаФорма;
	Для Каждого ИмяРеквизита Из ЧастиПути Цикл 
		ВладелецЗначения = ТекущееЗначение;
		ТекущееЗначение  = ТекущееЗначение[ИмяРеквизита];
	КонецЦикла;
	
	ЭтаФорма[ИмяРеквизита + "Данные"] = Значение;
	ВладелецЗначения[ИмяРеквизита] = ЧислаКлиентСервер.ПолучитьПредставлениеЧисла(Значение);
	
	ЭтаФорма.Модифицированность = Истина;
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			ЭтаФорма.Реквизит1ТипаЧислоДанные = Параметры.ЗначениеКопирования.Реквизит1ТипаЧислоДанные.Получить();
		Иначе
			ЭтаФорма.Реквизит1ТипаЧислоДанные = ЧислаКлиентСервер.СтруктураЧисла();
		КонецЕсли;
	Иначе
		ЭтаФорма.Реквизит1ТипаЧислоДанные = Объект.Ссылка.Реквизит1ТипаЧислоДанные.Получить();
	КонецЕсли; 
	Объект.Реквизит1ТипаЧисло = ЧислаКлиентСервер.ПолучитьПредставлениеЧисла(ЭтаФорма.Реквизит1ТипаЧислоДанные);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Реквизит1ТипаЧислоДанные = Новый ХранилищеЗначения(ЭтаФорма.Реквизит1ТипаЧислоДанные);
	
КонецПроцедуры
