////////////////////////////////////////////////////////////////////////////////
// Подсистема "Стандартные подсистемы ИТГ".
// ОбщийМодуль.СтандартныеПодсистемыКлиентСерверИТГ.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает номер версии библиотеки.
//
// Возвращаемое значение:
//	Строка - номер версии библиотеки.
//
Функция ВерсияБиблиотеки() Экспорт
	
	Возврат "1.1.0.2";
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти
