////////////////////////////////////////////////////////////////////////////////
// Подсистема "Стандартные подсистемы ИТГ. Структурированные реквизиты".
// ОбщийМодуль.СтруктурированныеРеквизитыКлиентСервер.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает номер версии библиотеки.
//
// Возвращаемое значение:
//	Строка - номер версии библиотеки.
//
Функция ВерсияБиблиотеки() Экспорт
	
	Возврат "0.1.0.1";
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
