

#Область ПрограммныйИнтерфейс

#Область СтепениИИндексы

// Преобразует переданный показатель степени (число) в наименование степени.
// Например, "в квадрате", "в четвёртой степени".
//
// Параметры:
//  ПоказательСтепени	 - Строка, Число	 - Показатель степени
// 	Падеж 	- Число  			- падеж, в который необходимо просклонять представление объекта.
//                  			1 - Именительный.
//                  			2 - Родительный.
//                  			3 - Дательный.
//                  			4 - Винительный.
//                  			5 - Творительный.
//                  			6 - Предложный.
// 
// Возвращаемое значение:
//   Строка - наименование степени
//
Функция ПолучитьНаименованиеИзПоказателяСтепени(Знач ПоказательСтепени, Знач Падеж = 1) Экспорт
	Соответствие = ПолучитьСоответствиеНаименованийСтепеней();
	Возврат СклонениеПредставленийОбъектов.ПросклонятьПредставление(
		Соответствие.Получить(Число(ПоказательСтепени))
		, Падеж
	);
КонецФункции

// Преобразует переданный показатель степени (число) в наименование степени в виде прилагательного.
// Например, "квадратный", "кубический".
//
// Параметры:
//  ПоказательСтепени	 - Строка, Число	 - Показатель степени
// 	Падеж 	- Число  			- падеж, в который необходимо просклонять представление объекта.
//                  			1 - Именительный.
//                  			2 - Родительный.
//                  			3 - Дательный.
//                  			4 - Винительный.
//                  			5 - Творительный.
//                  			6 - Предложный.
// 
// Возвращаемое значение:
//   Строка - наименование степени
//
Функция ПолучитьНаименованиеИзПоказателяСтепениКакПрилагательное(Знач ПоказательСтепени, Знач Падеж = 1) Экспорт
	Соответствие = ПолучитьСоответствиеНаименованийСтепенейКакПрилагательных();
	Возврат Соответствие.Получить(Число(ПоказательСтепени));
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Формирует соответствие надстрочных индексов строчным символам.
//
Функция ПолучитьСоответствиеНадстрочныхИндексов() Экспорт
	
	Результат = Новый Соответствие();
	
	Результат.Вставить("0","⁰");
	Результат.Вставить("1","¹");
	Результат.Вставить("2","²");
	Результат.Вставить("3","³");
	Результат.Вставить("4","⁴");
	Результат.Вставить("5","⁵");
	Результат.Вставить("6","⁶");
	Результат.Вставить("7","⁷");
	Результат.Вставить("8","⁸");
	Результат.Вставить("9","⁹");
	
	Результат.Вставить("-","⁻");
	Результат.Вставить("+","⁺");
	
	Возврат Результат;
	
КонецФункции

// Формирует соответствие постфиксов к наименованию степени
// по показателю степени.
//
Функция ПолучитьСоответствиеНаименованийСтепеней() 
	
	Результат = Новый Соответствие();
	
	Результат.Вставить(0,"");
	Результат.Вставить(1,"");
	Результат.Вставить(2,"в квадрате");
	Результат.Вставить(3,"в кубе");
	Результат.Вставить(4,"в четвёртой степени");
	Результат.Вставить(5,"в пятой степени");
	Результат.Вставить(6,"в шестой степени");
	Результат.Вставить(7,"в седьмой степени");
	Результат.Вставить(8,"в восьмой степени");
	Результат.Вставить(9,"в девятой степени");
	
	Возврат Результат;
	
КонецФункции

// Формирует соответствие постфиксов к наименованию степени
// по показателю степени.
//
Функция ПолучитьСоответствиеНаименованийСтепенейКакПрилагательных() 
	
	Результат = Новый Соответствие();
	
	Результат.Вставить(0,"");
	Результат.Вставить(1,"");
	Результат.Вставить(2,"квадратный");
	Результат.Вставить(3,"кубический");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
