
#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Степени и индексы

// Преобразует переданный показатель степени (число) в наименование степени.
// Например, "в квадрате", "в четвёртой степени".
//
// Параметры:
//   ПоказательСтепени	 - Строка, Число	 - Показатель степени
// 	 Падеж 	- Число  			- падеж, в который необходимо просклонять представление объекта.
//                  			1 - Именительный.
//                  			2 - Родительный.
//                  			3 - Дательный.
//                  			4 - Винительный.
//                  			5 - Творительный.
//                  			6 - Предложный.
// 
// Возвращаемое значение:
//   Строка - наименование степени
//
Функция ПолучитьНаименованиеИзПоказателяСтепени(Знач ПоказательСтепени, Знач Падеж = 1) Экспорт
	
	Возврат СклонениеПредставленийОбъектов.ПросклонятьПредставление(
		ПолучитьСоответствиеНаименованийСтепеней().Получить(Число(ПоказательСтепени))
		, Падеж
	);
	
КонецФункции

// Преобразует переданный показатель степени (число) в наименование степени в виде прилагательного.
// Например, "квадратный", "кубический".
//
// Параметры:
//   ПоказательСтепени	 - Строка, Число	 - Показатель степени
// 	 Падеж 	- Число  			- падеж, в который необходимо просклонять представление объекта.
//                  			1 - Именительный.
//                  			2 - Родительный.
//                  			3 - Дательный.
//                  			4 - Винительный.
//                  			5 - Творительный.
//                  			6 - Предложный.
// 
// Возвращаемое значение:
//   Строка - наименование степени
//
Функция ПолучитьНаименованиеИзПоказателяСтепениКакПрилагательное(Знач ПоказательСтепени, Знач Падеж = 1) Экспорт

	Возврат ПолучитьСоответствиеНаименованийСтепенейКакПрилагательных().Получить(Число(ПоказательСтепени));
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Формирует соответствие надстрочных индексов строчным символам.
//
Функция ПолучитьСоответствиеНадстрочныхИндексов() Экспорт
	
	Результат = Новый Соответствие();
	
	Результат.Вставить("0","⁰");
	Результат.Вставить("1","¹");
	Результат.Вставить("2","²");
	Результат.Вставить("3","³");
	Результат.Вставить("4","⁴");
	Результат.Вставить("5","⁵");
	Результат.Вставить("6","⁶");
	Результат.Вставить("7","⁷");
	Результат.Вставить("8","⁸");
	Результат.Вставить("9","⁹");
	
	Результат.Вставить("-","⁻");
	Результат.Вставить("+","⁺");
	
	Возврат Новый ФиксированноеСоответствие(Результат);
	
КонецФункции

// Формирует соответствие постфиксов к наименованию степени
// по показателю степени.
//
// Параметры:
//   КодЯзыка - Строка - Указывается код языка, на котором нужно получить строку.
//     Если значение не указано, то строка будет выдаваться на языке, определенного
//     для текущего пользователя.
// 
// Возвращаемое значение: Соответствие
//
Функция ПолучитьСоответствиеНаименованийСтепеней(Знач КодЯзыка = "")
	
	Перем Результат;
	
	Результат = Новый Соответствие();
	
	Результат.Вставить(0, "");
	Результат.Вставить(1, "");
	Результат.Вставить(2, НСтр("ru='в квадрате'; en='squared'", КодЯзыка));
	Результат.Вставить(3, НСтр("ru='в кубе'; en='cubed'", КодЯзыка));
	Результат.Вставить(4, НСтр("ru='в четвёртой степени; en='to the fourth power'", КодЯзыка));
	Результат.Вставить(5, НСтр("ru='в пятой степени; en='in the fifth degree'", КодЯзыка));
	Результат.Вставить(6, НСтр("ru='в шестой степени; en='to the sixth power'", КодЯзыка));
	Результат.Вставить(7, НСтр("ru='в седьмой степени; en='in the seventh degree'", КодЯзыка));
	Результат.Вставить(8, НСтр("ru='в восьмой степени; en='in eighth degree'", КодЯзыка));
	Результат.Вставить(9, НСтр("ru='в девятой степени; en='in the ninth degree'", КодЯзыка));
	
	Возврат Новый ФиксированноеСоответствие(Результат);
	
КонецФункции

// Формирует соответствие шаблонов наименований степеней показателю степени.
//
// Параметры:
//   ОбъектГеометрический - Булево - вернуть "квадратный метр" вместо "метр в квадрате"
//   КодЯзыка - Строка - Указывается код языка, на котором нужно получить строку.
//     Если значение не указано, то строка будет выдаваться на языке, определенного
//     для текущего пользователя.
// 
// Возвращаемое значение: Соответствие
//
Функция ПолучитьСоответствиеШаблоновНаименованийСтепеней(Знач ОбъектГеометрический = Ложь, Знач КодЯзыка = "") Экспорт
	
	Перем Результат;
	
	Результат = Новый Соответствие();
	
	Результат.Вставить(0, "");
	Результат.Вставить(1, "%1");
	
	Если ОбъектГеометрический Тогда
		Результат.Вставить(2, НСтр("ru='квадратный %1'; en='square %1'", КодЯзыка));
		Результат.Вставить(3, НСтр("ru='кубический %1'; en='cubic %1'", КодЯзыка));
	Иначе
		Результат.Вставить(2, НСтр("ru='%1 в квадрате'; en='%1 in a square'", КодЯзыка));
		Результат.Вставить(3, НСтр("ru='%1 в кубе'; en='%1 in cube'", КодЯзыка));
	КонецЕсли;
	
	Результат.Вставить(4, НСтр("ru='%1 в четвёртой степени'; en='%1 to fourth degree'", КодЯзыка));
	Результат.Вставить(5, НСтр("ru='%1 в пятой степени'; en='%1 in the fifth degree'", КодЯзыка));
	Результат.Вставить(6, НСтр("ru='%1 в шестой степени'; en='%1 in sixth degree'", КодЯзыка));
	Результат.Вставить(7, НСтр("ru='%1 в седьмой степени'; en='%1 in seventh degree'", КодЯзыка));
	Результат.Вставить(8, НСтр("ru='%1 в восьмой степени'; en='%1 in the eighth degree'", КодЯзыка));
	Результат.Вставить(9, НСтр("ru='%1 в девятой степени'; en='%1 in ninth degree'", КодЯзыка));
	
	Возврат Новый ФиксированноеСоответствие(Результат);
	
КонецФункции

// Формирует соответствие постфиксов к наименованию степени
// по показателю степени.
//
// Параметры:
//   КодЯзыка - Строка - Указывается код языка, на котором нужно получить строку.
//     Если значение не указано, то строка будет выдаваться на языке, определенного
//     для текущего пользователя.
// 
// Возвращаемое значение: Соответствие
//
Функция ПолучитьСоответствиеНаименованийСтепенейКакПрилагательных(Знач КодЯзыка = "")
	
	Перем Результат;
	Результат = Новый Соответствие();
	
	Результат.Вставить(0,"");
	Результат.Вставить(1,"");
	Результат.Вставить(2,НСтр("ru = 'квадратный'; en = 'square'", КодЯзыка));
	Результат.Вставить(3,НСтр("ru = 'кубический'; en = 'cubic'", КодЯзыка));
	
	Возврат Новый ФиксированноеСоответствие(Результат);
	
КонецФункции

#КонецОбласти
