#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриЗаписи(Отказ)
		
	Константы.МСИспользоватьПриставкиРусские.Установить(Значение = Перечисления.МСЕдиницыВеличинОбозначения.Русские);
	Константы.МСИспользоватьПриставкиМеждународные.Установить(Значение = Перечисления.МСЕдиницыВеличинОбозначения.Международные);
	Константы.МСИспользоватьПриставкиРусскиеISO_80000_1.Установить(Значение = Перечисления.МСЕдиницыВеличинОбозначения.РусскиеISO_80000_1);
	Константы.МСИспользоватьПриставкиМеждународныеISO_80000_1.Установить(Значение = Перечисления.МСЕдиницыВеличинОбозначения.МеждународныеISO_80000_1);
	
КонецПроцедуры;

#КонецЕсли

