#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриЗаписи(Отказ)
		
	// для использования только одного варианта обозначений
	//Для Каждого ВариантОбозначения Из Метаданные.Перечисления.МСЕдиницыВеличинОбозначения.ЗначенияПеречисления Цикл
	//	Константы["МСИспользоватьОбозначения" + ВариантОбозначения.Имя].Установить(
	//		Значение = Перечисления.МСЕдиницыВеличинОбозначения[ВариантОбозначения.Имя]
	//	);
	//КонецЦикла;
	
	Константы["МСИспользоватьОбозначения" + ОбщегоНазначения.ИмяЗначенияПеречисления(Значение)].Установить(Истина);
	
КонецПроцедуры;

#КонецЕсли

